
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Corba兴衰史 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../corbaxiang-guan.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1.html">
            
                <a href="../chapter1.html">
            
                    
                    中间件发展史
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" >
            
                <span>
            
                    
                    中间件定义
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../corbaxiang-guan.html">
            
                <a href="../corbaxiang-guan.html">
            
                    
                    Corba相关
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="corbaxing-shuai-shi.html">
            
                <a href="corbaxing-shuai-shi.html">
            
                    
                    Corba兴衰史
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    JavaEE相关
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    微软中间件相关
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    Web框架
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" >
            
                <span>
            
                    
                    SSH
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" >
            
                <span>
            
                    
                    SSM
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" >
            
                <span>
            
                    
                    Python相关
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Corba兴衰史</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="corba&#x5174;&#x8870;&#x53F2;">Corba&#x5174;&#x8870;&#x53F2;</h1>
<p>&#x5728;90&#x5E74;&#x4EE3;&#x65E9;&#x671F;&#xFF0C;&#x8981;&#x4F7F;&#x4E0D;&#x540C;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x662F;&#x4E00;&#x573A;&#x6076;&#x68A6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x5B58;&#x5728;&#x7684;&#x73AF;&#x5883;&#xFF1A;&#x7A0B;&#x5E8F;&#x5458;&#x8981;&#x4E48;&#x4F7F;&#x7528;socket&#x9760;&#x81EA;&#x5DF1;&#x6765;&#x5199;&#x6574;&#x4E2A;&#x534F;&#x8BAE;&#x6808;&#xFF0C;&#x8981;&#x4E48;&#x4ED6;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x5C31;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x901A;&#x4FE1;&#x3002;&#xFF08;&#x5176;&#x5B83;&#x65E9;&#x671F;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5982;Sun&#x7684;ONC&#xFF0C;Apollo&#x7684;NCS&#x4EE5;&#x53CA;DCE&#xFF0C;&#x90FD;&#x662F;&#x57FA;&#x4E8E;C&#x8BED;&#x8A00;&#x548C;UNIX&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x4E8E;&#x5F02;&#x6784;&#x7684;&#x73AF;&#x5883;&#xFF09;&#x3002;</p>
<p>CORBA 1.0&#x5E76;&#x4E0D;&#x6210;&#x529F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x80FD;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x63D0;&#x4F9B;C&#x8BED;&#x8A00;&#x7684;&#x6620;&#x5C04;&#x3002;OMG&#x5728;1997&#x5E74;&#x53D1;&#x5E03;&#x4E86;CORBA 2.0&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x6807;&#x51C6;&#x534F;&#x8BAE;&#xFF0C;&#x4EE5;&#x53CA;C++&#x8BED;&#x8A00;&#x7684;&#x6620;&#x5C04;&#xFF0C;1998&#x5E74;&#x63D0;&#x4F9B;&#x4E86;Java&#x8BED;&#x8A00;&#x7684;&#x6620;&#x5C04;&#x3002;CORBA 2.0&#x4F7F;&#x5F97;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5730;&#x6784;&#x5EFA;&#x5F02;&#x6784;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x3002;CORBA&#x5F88;&#x5FEB;&#x5C31;&#x6D41;&#x884C;&#x8D77;&#x6765;&#xFF0C;&#x5F88;&#x591A;&#x4EFB;&#x52A1;&#x5173;&#x952E;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x7528;CORBA&#x6765;&#x6784;&#x5EFA;&#x3002;CORBA&#x7684;&#x524D;&#x666F;&#x770B;&#x4E0A;&#x53BB;&#x975E;&#x5E38;&#x4E50;&#x89C2;&#x3002;</p>
<p>&#x5728;&#x7ECF;&#x5386;&#x4E86;90&#x5E74;&#x4EE3;&#x4E2D;&#x540E;&#x671F;&#x7684;&#x589E;&#x957F;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x7684;&#x53D8;&#x5316;&#x5F71;&#x54CD;&#x4E86;&#x8BA1;&#x7B97;&#x7684;&#x524D;&#x666F;&#xFF0C;&#x6700;&#x4E3A;&#x8457;&#x540D;&#x7684;&#x5C31;&#x662F;Java&#x4E0E;Web&#x7684;&#x51FA;&#x73B0;&#x3002;CORBA&#x63D0;&#x4F9B;&#x4E86;Java&#x8BED;&#x8A00;&#x6620;&#x5C04;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x7206;&#x70B8;&#x5F0F;&#x589E;&#x957F;&#x7684;Web&#x3002;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x5E76;&#x6CA1;&#x6709;&#x7B49;&#x5F85;CORBA&#x7ED9;&#x51FA;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5B83;&#x4EEC;&#x8F6C;&#x5411;&#x4E86;&#x5176;&#x5B83;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4E14;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x4ED6;&#x4EEC;&#x57FA;&#x4E8E;Web&#x6D4F;&#x89C8;&#x5668;&#x3001;HTTP&#x3001;Java&#x548C;EJB&#x7684;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6709;&#x7ECF;&#x9A8C;&#x7684;CORBA&#x5F00;&#x53D1;&#x8005;&#x53D1;&#x73B0;&#x7F16;&#x5199;&#x5B9E;&#x7528;&#x7684;CORBA&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x76F8;&#x5F53;&#x5730;&#x56F0;&#x96BE;&#x3002;&#x8BB8;&#x591A;API&#x90FD;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x795E;&#x79D8;&#xFF0C;&#x4F7F;&#x5F97;&#x5F00;&#x53D1;&#x8005;&#x5FC5;&#x987B;&#x5173;&#x6CE8;&#x8BB8;&#x591A;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#x3002;&#x60F3;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x7684;&#x7B80;&#x5355;&#x6027;&#xFF0C;&#x6BD4;&#x5982;EJB&#xFF0C;&#x4F7F;&#x5F97;&#x7F16;&#x7A0B;&#x7B80;&#x5355;&#x5F97;&#x591A;&#xFF08;&#x867D;&#x7136;&#x4E0D;&#x90A3;&#x4E48;&#x7075;&#x6D3B;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;CORBA&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x7684;&#x547C;&#x58F0;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x3002;&#x4F46;&#x662F;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x7684;&#x5230;&#x6765;&#x82B1;&#x4E86;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x59CB;&#x4E8E;1996&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#x57FA;&#x4E8E;CBOF&#xFF08;&#x901A;&#x7528;&#x4E1A;&#x52A1;&#x5BF9;&#x8C61;&#x8BBE;&#x65BD;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E2A;&#x52AA;&#x529B;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#x884C;&#x653F;&#x7B56;&#x7565;&#x4E0A;&#x7684;&#x6597;&#x4E89;&#x9677;&#x5165;&#x4E86;&#x56F0;&#x5883;&#xFF0C;&#x4E0D;&#x4E45;&#x5C31;&#x88AB;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;CORBA&#x7EC4;&#x4EF6;&#x6A21;&#x578B;CCM&#x3002;1999&#x5E74;CCM&#x7684;&#x89C4;&#x8303;&#x7EC8;&#x4E8E;&#x53D1;&#x5E03;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x786E;&#x6210;&#x4E3A;&#x4E86;&#x96F7;&#x58F0;&#x5927;&#x3001;&#x96E8;&#x70B9;&#x5C0F;&#x7684;&#x4E8B;&#x3002;</p>
<p>&#x89C4;&#x8303;&#x5DE8;&#x5927;&#x800C;&#x590D;&#x6742;&#xFF0C;&#x8BB8;&#x591A;&#x90FD;&#x672A;&#x66FE;&#x88AB;&#x5B9E;&#x73B0;&#x8FC7;&#xFF0C;&#x751A;&#x81F3;&#x6982;&#x5FF5;&#x6027;&#x7684;&#x8BC1;&#x660E;&#x90FD;&#x6CA1;&#x505A;&#x8FC7;&#x3002;&#x9605;&#x8BFB;&#x6587;&#x6863;&#x5C31;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x77E5;&#x9053;CCM&#x6280;&#x672F;&#x4E0A;&#x662F;&#x4E0D;&#x6210;&#x719F;&#x7684;&#xFF1B;&#x90E8;&#x5206;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x5B9E;&#x73B0;&#xFF0C;&#x5373;&#x4F7F;&#x5B9E;&#x73B0;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3002;</p>
<p>&#x975E;&#x5546;&#x7528;&#x7684;CORBA&#x5382;&#x5546;&#x627F;&#x62C5;&#x4E86;&#x5B9E;&#x73B0;CCM&#x7684;&#x4E49;&#x52A1;&#xFF0C;&#x5374;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x4E86;&#x592D;&#x6298;&#x7684;&#x5B69;&#x5B50;&#x3002;&#x5373;&#x4FBF;&#x5728;CCM&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x5B9E;&#x73B0;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#xFF0C;&#x4E5F;&#x592A;&#x8FDF;&#x4E86;&#x3002;&#x673A;&#x4F1A;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E86;&#xFF1A;EJB&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x4E86;&#x4EA7;&#x4E1A;&#xFF0C;&#x5176;&#x5B83;&#x6280;&#x672F;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x3002;CCM&#x7684;&#x5931;&#x5229;&#x5E76;&#x672A;&#x589E;&#x52A0;CORBA&#x5BA2;&#x6237;&#x7684;&#x4FE1;&#x5FC3;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BA2;&#x6237;&#x6B63;&#x9677;&#x4E8E;CORBA&#x590D;&#x6742;&#x6280;&#x672F;&#x7684;&#x6CE5;&#x6F6D;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x5DE5;&#x4E1A;&#x754C;&#x5BF9;&#x4E8E;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x9700;&#x6C42;&#x51FA;&#x73B0;&#x4E86;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x9AD8;&#x6DA8;&#x3002;&#x5728;&#x4F7F;&#x7528;HTTP&#x3001;HTML&#x548C;CGI&#x6784;&#x5EFA;&#x4E86;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;&#x4E4B;&#x540E;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x5F0F;&#x6784;&#x5EFA;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x4E86;&#x660E;&#x663E;&#x7684;&#x4E25;&#x91CD;&#x7F3A;&#x9677;&#x3002;&#x6CA1;&#x6709;&#x9002;&#x5F53;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E94;&#x7528;&#x88AB;&#x8FEB;&#x89E3;&#x6790;HTML&#x6765;&#x63D0;&#x53D6;&#x8BED;&#x4E49;&#xFF0C;&#x8FD9;&#x4E0E;&#x6293;&#x5C4F;&#x4E00;&#x6837;&#x6CA1;&#x4EC0;&#x4E48;&#x4EF7;&#x503C;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x975E;&#x5E38;&#x8106;&#x5F31;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;EJB&#x62E5;&#x6709;&#x6B63;&#x786E;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x662F;&#x5C40;&#x9650;&#x4E8E;Java&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x8BB8;&#x591A;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x5546;&#x7528;CORBA&#x5B9E;&#x73B0;&#x4E00;&#x822C;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x5E2D;&#x4F4D;&#x90FD;&#x4F1A;&#x82B1;&#x8D39;&#x51E0;&#x5343;&#x7F8E;&#x5143;&#x5DE6;&#x53F3;&#xFF0C;&#x52A0;&#x4E0A;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7248;&#x7A0E;&#xFF08;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x540E;&#x6536;&#x53D6;&#xFF09;&#x3002;&#x5BF9;&#x8BB8;&#x591A;&#x6F5C;&#x5728;&#x7684;&#x5BA2;&#x6237;&#x6765;&#x8BF4;&#xFF0C;CORBA&#x8FD9;&#x6837;&#x7684;&#x5E73;&#x53F0;&#x9650;&#x5236;&#x5BF9;&#x4ED6;&#x4EEC;&#x6765;&#x8BF4;&#x592A;&#x6602;&#x8D35;&#x4E86;&#x3002;</p>
<p>CORBA&#x5E73;&#x53F0;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x9661;&#x5CED;&#xFF0C;&#x6280;&#x672F;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x4E86;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x957F;&#xFF0C;&#x6613;&#x51FA;&#x9519;&#x3002;&#x65E9;&#x671F;&#x7684;&#x5B9E;&#x73B0;&#x5E38;&#x5E38;&#x5145;&#x6EE1;Bug&#x5E76;&#x4E14;&#x53D7;&#x82E6;&#x4E8E;&#x7F3A;&#x4E4F;&#x6709;&#x8D28;&#x91CF;&#x7684;&#x6587;&#x6863;&#x3002;&#x516C;&#x53F8;&#x4E0D;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x6709;&#x7ECF;&#x9A8C;&#x7684;CORBA&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x5FAE;&#x8F6F;&#x5E76;&#x6CA1;&#x6709;&#x4F7F;&#x7528;CORBA&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x63A8;&#x51FA;&#x81EA;&#x5DF1;&#x7684;DCOM&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5E02;&#x573A;&#x8981;&#x4E48;&#x9009;&#x62E9;&#x4E2D;&#x7ACB;&#x8981;&#x4E48;&#x4F7F;&#x7528;DCOM&#xFF0C;&#x4F46;&#x662F;DCOM&#x672A;&#x80FD;&#x8D62;&#x5F97;&#x4E2D;&#x95F4;&#x4EF6;&#x4E4B;&#x6218;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EC5;&#x4EC5;&#x80FD;&#x5DE5;&#x4F5C;&#x5728;Windows&#x5E73;&#x53F0;&#x4E0A;&#x3002;&#xFF08;Software AG&#x505A;&#x4E86;&#x4E00;&#x4E2A;UNIX&#x7684;&#x79FB;&#x690D;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x83B7;&#x5F97;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x52A8;&#x529B;&#xFF09;&#x3002;&#x5FAE;&#x8F6F;&#x5728;&#x51E0;&#x6B21;&#x6269;&#x5C55;DCOM&#x5E94;&#x7528;&#x8303;&#x56F4;&#x7684;&#x5C1D;&#x8BD5;&#x5931;&#x5229;&#x4EE5;&#x540E;&#xFF0C;&#x6700;&#x540E;&#x653E;&#x5F03;&#x4E86;DCOM&#x3002;&#x90A3;&#x65F6;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x5E02;&#x573A;&#x5904;&#x4E8E;&#x652F;&#x79BB;&#x7834;&#x788E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8BB8;&#x591A;&#x6280;&#x672F;&#x5728;&#x7ADE;&#x4E89;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x54EA;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x8DB3;&#x591F;&#x7684;&#x4EFD;&#x989D;&#x6765;&#x7EDF;&#x4E00;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5BFC;&#x81F4;CORBA&#x4E0B;&#x964D;&#x7684;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x662F;XML&#x3002;90&#x5E74;&#x4EE3;&#x540E;&#x671F;&#xFF0C;XML&#x6210;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x5DE5;&#x4E1A;&#x65B0;&#x7684;&#x94F6;&#x5F39;&#xFF1A;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x53EA;&#x8981;&#x662F;&#x5B9A;&#x4E49;&#x4E3A;XML&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x597D;&#x7684;&#x3002;&#x5728;&#x653E;&#x5F03;&#x4E86;DCOM&#x4E4B;&#x540E;&#xFF0C;&#x5FAE;&#x8F6F;&#x5E76;&#x6CA1;&#x6709;&#x628A;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5E02;&#x573A;&#x7559;&#x7ED9;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#xFF0C;&#x5FAE;&#x8F6F;&#x6CA1;&#x6709;&#x518D;&#x53C2;&#x4E0E;&#x4E00;&#x573A;&#x4E0D;&#x53EF;&#x80FD;&#x6253;&#x8D62;&#x7684;&#x6218;&#x4E89;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;XML&#x6765;&#x5F00;&#x8F9F;&#x4E86;&#x65B0;&#x7684;&#x6218;&#x573A;&#x3002;&#x5728;1999&#x5E74;&#x5E74;&#x672B;&#xFF0C;&#x5DE5;&#x4E1A;&#x754C;&#x770B;&#x5230;&#x4E86;SOAP&#x7684;&#x53D1;&#x5E03;&#x3002;SOAP&#x7531;&#x5FAE;&#x8F6F;&#x548C;DevelopMentor&#x53D1;&#x5E03;&#xFF0C;&#x968F;&#x540E;&#x63D0;&#x4EA4;&#x7ED9;W3C&#x4F5C;&#x4E3A;&#x6807;&#x51C6;&#xFF0C;SOAP&#x4F7F;&#x7528;XML&#x4F5C;&#x4E3A;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x7EBF;&#x4E0A;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x3002;</p>
<p>SOAP&#x6709;&#x4E25;&#x91CD;&#x7684;&#x6280;&#x672F;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5E02;&#x573A;&#x7B56;&#x7565;&#xFF0C;&#x5B83;&#x662F;&#x5DE7;&#x5999;&#x7684;&#x4E00;&#x62DB;&#x3002;&#x968F;&#x7740;&#x5927;&#x91CF;&#x7684;&#x5382;&#x5546;&#x90FD;&#x60F3;&#x5206;&#x4E00;&#x676F;&#x7FB9;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;CORBA&#x8F6C;&#x5411;&#x840C;&#x82BD;&#x7684;Web&#x670D;&#x52A1;&#x5E02;&#x573A;&#xFF0C;&#x5E02;&#x573A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7684;&#x5206;&#x5316;&#x3002;&#x5BF9;&#x5BA2;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x589E;&#x52A0;&#x4E86;CORBA&#x751F;&#x5B58;&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x5F97;&#x4ED6;&#x4EEC;&#x66F4;&#x52A0;&#x6295;&#x8D44;&#x4E8E;&#x6709;&#x628A;&#x63E1;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<p>&#x5F53;2002&#x5E74;Internet&#x6CE1;&#x6CAB;&#x7834;&#x706D;&#x65F6;&#xFF0C;CORBA&#x906D;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x6253;&#x51FB;&#x3002;&#x5DE5;&#x4E1A;&#x754C;&#x7684;&#x91D1;&#x878D;&#x5D29;&#x6E83;&#x4F7F;&#x5F97;&#x8BB8;&#x591A;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#x9000;&#x51FA;&#x5E02;&#x573A;&#xFF0C;&#x5E78;&#x5B58;&#x8005;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x96C6;&#x4E2D;&#x5B83;&#x4EEC;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x7ED3;&#x679C;&#x5BFC;&#x81F4;&#x4E86;&#x5927;&#x91CF;&#x5546;&#x7528;CORBA&#x4EA7;&#x54C1;&#x7684;&#x635F;&#x8017;&#x3002;&#x5728;&#x5D29;&#x76D8;&#x4E4B;&#x524D;&#xFF0C;&#x51E0;&#x4E2A;&#x5382;&#x5546;&#x5DF2;&#x7ECF;&#x505C;&#x6B62;&#x6216;&#x8005;&#x8FB9;&#x7F18;&#x5316;&#x4E86;&#x5B83;&#x4EEC;&#x7684;CORBA&#x4EA7;&#x54C1;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5D29;&#x76D8;&#x540E;&#xFF0C;&#x66F4;&#x591A;&#x7684;CORBA&#x4EA7;&#x54C1;&#x968F;&#x4E4B;&#x5E76;&#x505C;&#x6B62;&#x3002;&#x5728;90&#x5E74;&#x4EE3;&#x4E2D;&#x671F;&#x5230;&#x540E;&#x671F;&#x4E00;&#x7247;&#x7E41;&#x8363;&#x666F;&#x8C61;&#x7684;&#x8BB8;&#x591A;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x4EA7;&#x54C1;&#x5FFD;&#x7136;&#x6210;&#x4E3A;&#x4E86;&#x5E02;&#x573A;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;&#x6781;&#x5C11;&#x7684;&#x5382;&#x5546;&#x3001;&#x5BA2;&#x6237;&#x548C;&#x6295;&#x8D44;&#x8005;&#x3002;&#x90A3;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;CORBA&#x7684;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x91CD;&#x5EFA;&#x4E86;&#x5E02;&#x573A;&#x7684;&#x4FE1;&#x5FC3;&#xFF1A;CORBA&#x4E0D;&#x518D;&#x662F;&#x4E1A;&#x754C;&#x5FC3;&#x7231;&#x7684;&#x5B69;&#x5B50;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;CORBA&#x5927;&#x591A;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x4E0E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x7684;&#x901A;&#x4FE1;&#x7531;&#x9632;&#x706B;&#x5899;&#x8FDB;&#x884C;&#x4FDD;&#x62A4;&#x3002;CORBA&#x4E5F;&#x7528;&#x4E8E;&#x5B9E;&#x65F6;&#x548C;&#x5D4C;&#x5165;&#x5F0F;&#x5F00;&#x53D1;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;CORBA&#x786E;&#x5B9E;&#x5728;&#x589E;&#x957F;&#x3002;&#x6574;&#x4F53;&#x4E0A;&#x8BF4;&#xFF0C;CORBA&#x7684;&#x4F7F;&#x7528;&#x5728;&#x51CF;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x4EC5;&#x4EC5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9002;&#x5F97;&#x5176;&#x6240;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5176;&#x5B83;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x662F;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x4EC5;&#x4EC5;&#x51E0;&#x5E74;&#x524D;&#xFF0C;CROBA&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5148;&#x8FDB;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#x9769;&#x65B0;&#x7535;&#x5B50;&#x5546;&#x52A1;&#xFF0C;&#x73B0;&#x5728;&#x4EE4;&#x4EBA;&#x60CA;&#x5947;&#x7684;&#x662F;&#x6280;&#x672F;&#x5982;&#x6B64;&#x5FEB;&#x5730;&#x88AB;&#x8FB9;&#x7F18;&#x5316;&#xFF0C;&#x4E3A;&#x6B64;&#x79CD;&#x5931;&#x5229;&#x5206;&#x6790;&#x5176;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6709;&#x76CA;&#x7684;&#x3002;</p>
<p>Technical Issues&#x6280;&#x672F;&#x56E0;&#x7D20;</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5916;&#x90E8;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x4E86;CORBA&#x7684;&#x5931;&#x5229;&#xFF0C;&#x6BD4;&#x5982;Internet&#x6CE1;&#x6CAB;&#x7684;&#x7834;&#x706D;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x6280;&#x672F;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;&#x6BD4;&#x5982;DCOM,EBJ&#x548C;Web&#x670D;&#x52A1;&#x3002;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;CORBA&#x662F;&#x5DE5;&#x4E1A;&#x8D8B;&#x52BF;&#x7684;&#x53D7;&#x5BB3;&#x8005;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x5DE5;&#x4E1A;&#x4E2D;&#xFF0C;&#x7279;&#x5B9A;&#x6280;&#x672F;&#x7684;&#x6280;&#x672F;&#x4F18;&#x52BF;&#x5E38;&#x5E38;&#x5BF9;&#x5176;&#x6210;&#x529F;&#x8D21;&#x732E;&#x5F88;&#x5C11;&#xFF0C;&#x4EFD;&#x989D;&#x548C;&#x5E02;&#x573A;&#x662F;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x7BC7;&#x8FA9;&#x8BBA;&#x6587;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x6574;&#x8BF4;&#x660E;CORBA&#x4E3A;&#x4F55;&#x5931;&#x5229;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x5982;&#x679C;&#x6280;&#x672F;&#x50CF;&#x539F;&#x6765;&#x7684;&#x8BBE;&#x60F3;&#x7684;&#x4E00;&#x6837;&#x5F15;&#x4EBA;&#x6CE8;&#x76EE;&#xFF0C;&#x5BA2;&#x6237;&#x4E0D;&#x4F1A;&#x629B;&#x5F03;&#x5B83;&#x800C;&#x9009;&#x62E9;&#x5176;&#x5B83;&#x7684;&#x66FF;&#x4EE3;&#x6280;&#x672F;&#x3002;</p>
<p>&#x6280;&#x672F;&#x4F18;&#x52BF;&#x5E76;&#x4E0D;&#x662F;&#x6210;&#x529F;&#x7684;&#x5145;&#x5206;&#x6761;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x957F;&#x671F;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;&#x4E0D;&#x7BA1;&#x6709;&#x591A;&#x5C11;&#x5DE5;&#x4E1A;&#x5E7B;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x6709;&#x4E25;&#x91CD;&#x7684;&#x6280;&#x672F;&#x7F3A;&#x9677;&#xFF0C;&#x5B83;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x4F1A;&#x88AB;&#x653E;&#x5F03;&#x7684;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x53D1;&#x73B0;&#x7684;CORBA&#x5931;&#x5229;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;</p>
<p>Complexity&#x590D;&#x6742;&#x6027;</p>
<p>&#x6700;&#x660E;&#x663E;&#x7684;&#x6280;&#x672F;&#x95EE;&#x9898;&#x5C31;&#x662F;CORBA&#x7684;&#x590D;&#x6742;&#x6027;--&#x7279;&#x522B;&#x662F;&#xFF0C;API&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x8BB8;&#x591A;CORBA&#x7684;API&#x6BD4;&#x8D77;&#x6240;&#x9700;&#x8981;&#x7684;&#x6765;&#x8BF4;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;CORBA&#x7684;&#x5BF9;&#x8C61;&#x9002;&#x914D;&#x5668;&#x8981;&#x6C42;&#x5927;&#x4E8E;200&#x884C;&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#xFF0C;&#x5176;&#x5B9E;30&#x884C;&#x7684;&#x5B9A;&#x4E49;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x540C;&#x6837;&#x7684;&#x529F;&#x80FD;--&#x5176;&#x5B83;170&#x884C;&#x5BF9;&#x4E8E;&#x529F;&#x80FD;&#x6765;&#x8BF4;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x9020;&#x6210;CORBA&#x8FD0;&#x884C;&#x65F6;&#x4E25;&#x91CD;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x5176;&#x5B83;&#x7684;&#x95EE;&#x9898;&#x662F;C++&#x8BED;&#x8A00;&#x7684;&#x6620;&#x5C04;&#x3002;&#x6620;&#x5C04;&#x4E0D;&#x6613;&#x4F7F;&#x7528;&#xFF0C;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x5BFC;&#x81F4;bug&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x7279;&#x522B;&#x5173;&#x4E8E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6027;&#x3001;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x6027;&#x548C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5927;&#x91CF;&#x7684;&#x5176;&#x5B83;&#x8FC7;&#x5EA6;&#x590D;&#x6742;&#x548C;&#x8BBE;&#x8BA1;&#x7CDF;&#x7CD5;&#x7684;API&#x5728;CORBA&#x89C4;&#x8303;&#x4E2D;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x6BD4;&#x5982;&#x540D;&#x5B57;&#x670D;&#x52A1;&#x3001;&#x4EA4;&#x6613;&#x670D;&#x52A1;&#x548C;&#x901A;&#x77E5;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;API&#x90FD;&#x662F;&#x6613;&#x9519;&#x7684;&#x3001;&#x4E0D;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;CCM&#x7684;&#x914D;&#x7F6E;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x590D;&#x6742;&#x4EE5;&#x81F4;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x9644;&#x52A0;&#x5DE5;&#x5177;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x96BE;&#x4EE5;&#x4EA7;&#x751F;&#x6709;&#x6548;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x7CDF;&#x7CD5;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x8BED;&#x8A00;&#x6620;&#x5C04;&#x662F;&#x4EFB;&#x4F55;&#x6280;&#x672F;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x201C;&#x9762;&#x5B50;&#x201D;&#xFF1A;&#x4ED6;&#x4EEC;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x5E73;&#x53F0;&#x76F8;&#x4F1A;&#x7684;&#x70B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x6613;&#x7528;&#x6027;&#x548C;&#x5B89;&#x5168;&#x6027;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x548C;&#x9519;&#x8BEF;&#x7D2F;&#x8BA1;&#x6709;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x660E;&#x663E;&#x5730;&#xFF0C;&#x4EFB;&#x4F55;&#x53D7;&#x56F0;&#x4E8E;&#x7279;&#x5B9A;&#x590D;&#x6742;&#x6027;&#x7684;&#x6280;&#x672F;&#x90FD;&#x4F7F;&#x5F97;&#x5B83;&#x81EA;&#x5DF1;&#x5BF9;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x8F83;&#x5C11;&#x5177;&#x6709;&#x4EB2;&#x5BC6;&#x6027;&#xFF0C;&#x5BF9;&#x4E8E;&#x7BA1;&#x7406;&#x6765;&#x8BF4;&#x5C31;&#x66F4;&#x662F;&#x5982;&#x6B64;&#x4E86;&#x3002;</p>
<p>&#x590D;&#x6742;&#x6027;&#x4E5F;&#x6765;&#x6E90;&#x4E8E;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;CORBA&#x7684;IOR&#xFF08;&#x4E92;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#xFF09;&#x662F;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x5185;&#x5BB9;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x4E0D;&#x5229;&#xFF1A;</p>
<p>&#x4E0D;&#x900F;&#x660E;&#x7684;&#x5F15;&#x7528;&#x51E0;&#x4E4E;&#x5F3A;&#x5236;&#x4F7F;&#x7528;&#x540D;&#x5B57;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x6CA1;&#x6709;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x7684;&#x5E2E;&#x52A9;&#x65F6;&#x4E0D;&#x80FD;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x590D;&#x6742;&#x5316;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x90E8;&#x7F72;&#xFF0C;&#x4E5F;&#x5C06;&#x5197;&#x4F59;&#x72B6;&#x6001;&#x5F15;&#x5165;&#x5230;&#x4E86;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF08;&#x4F34;&#x968F;&#x7740;&#x72B6;&#x6001;&#x51FA;&#x9519;&#x7684;&#x5371;&#x9669;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x521B;&#x9020;&#x51FA;&#x4E86;&#x53E6;&#x5916;&#x7684;&#x5931;&#x6548;&#x70B9;&#x3002;</p>
<p>&#x4E0D;&#x900F;&#x660E;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x5728;&#x76F8;&#x5F53;&#x7684;&#x7A0B;&#x5EA6;&#x4E0A;&#x590D;&#x6742;&#x5316;&#x4E86;API&#x3002;&#x4F8B;&#x5982;&#xFF0C;CORBA&#x7684;&#x62E6;&#x622A;API&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x7B80;&#x5316;&#x5F88;&#x591A;&#xFF0C;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x4E5F;&#x53EF;&#x4EE5;&#x900F;&#x660E;&#x3002;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x8981;&#x6C42;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x6BD4;&#x8F83;&#x5BF9;&#x8C61;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x5BF9;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x8C03;&#x7528;&#x7684;&#x8D1F;&#x8F7D;&#x662F;&#x7981;&#x6B62;&#x7684;&#x3002;</p>
<p>&#x5176;&#x5B83;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x7684;&#x539F;&#x56E0;&#x662F;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;CORBA&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x578B;&#xFF0C;&#x5B9A;&#x70B9;&#x548C;&#x6269;&#x5C55;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x6709;&#x754C;&#x548C;&#x65E0;&#x754C;&#x5E8F;&#x5217;&#x4EE5;&#x53CA;&#x6570;&#x7EC4;&#x548C;&#x80FD;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x503C;&#x7684;Any&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x652F;&#x6301;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x590D;&#x6742;&#x5316;&#x4E86;&#x8BB8;&#x591A;API&#xFF08;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x53CD;&#x5C04;&#x548C;&#x52A8;&#x6001;&#x8C03;&#x7528;&#x7684;&#x63A5;&#x53E3;&#xFF09;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x5FAE;&#x5999;&#x7684;&#x79FB;&#x690D;&#x6027;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Java&#x4E0D;&#x652F;&#x6301;&#x65E0;&#x7B26;&#x53F7;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;Java&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;C++&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x4F7F;&#x7528;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6EA2;&#x51FA;&#x95EE;&#x9898;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x672C;&#x5730;&#x5B9A;&#x70B9;&#x6216;&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#x652F;&#x6301;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x5B9E;&#x73B0;&#x5FC5;&#x987B;&#x6A21;&#x62DF;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x3002;&#x6A21;&#x62DF;&#x96BE;&#x4EE5;&#x7528;&#x8DE8;&#x5E73;&#x53F0;&#x7684;&#x7EDF;&#x4E00;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;API&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x4EE5;&#x8BCA;&#x65AD;&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x95EE;&#x9898;&#x7684;&#x6839;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;OMG&#x7684;&#x65E9;&#x671F;&#x5BF9;&#x8C61;&#x670D;&#x52A1;&#x89C4;&#x8303;&#xFF0C;&#x6BD4;&#x5982;&#x751F;&#x547D;&#x671F;&#x89C4;&#x8303;&#x3001;&#x67E5;&#x8BE2;&#x89C4;&#x8303;&#x3001;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x3001;&#x5173;&#x7CFB;&#x548C;&#x96C6;&#x5408;&#x670D;&#x52A1;&#x89C4;&#x8303;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x4E14;&#x6839;&#x672C;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x4EC5;&#x4EC5;&#x5728;&#x5DF2;&#x7ECF;&#x590D;&#x6742;&#x7684;&#x89C4;&#x8303;&#x96C6;&#x5408;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x566A;&#x97F3;&#xFF0C;&#x4F7F;&#x5F97;&#x5BA2;&#x6237;&#x8FF7;&#x60D1;&#xFF0C;&#x5E76;&#x4E14;&#x52A0;&#x5F3A;&#x4E86;CORBA&#x96BE;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x540D;&#x58F0;&#x3002;</p>
<p>Insufficient Features&#x4E0D;&#x8DB3;&#x7684;&#x7279;&#x5F81;</p>
<p>CORBA&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x4E30;&#x5BCC;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4E24;&#x79CD;&#x6838;&#x5FC3;&#x7279;&#x5F81;&#xFF1A;</p>
<p>&#x5B89;&#x5168;&#x6027;&#x3002;CORBA&#x7684;&#x6D41;&#x91CF;&#x662F;&#x4E0D;&#x52A0;&#x5BC6;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x5BB9;&#x6613;&#x88AB;&#x7A83;&#x542C;&#x4EE5;&#x53CA;&#x906D;&#x53D7;&#x63D2;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x90FD;&#x8981;&#x6C42;&#x9632;&#x706B;&#x5899;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x4E0E;&#x4F01;&#x4E1A;&#x5B89;&#x5168;&#x7B56;&#x7565;&#x662F;&#x76F8;&#x51B2;&#x7A81;&#x7684;&#x3002;&#xFF08;&#x9644;&#x5E26;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;CORBA&#x7684;&#x8FD9;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#x5BFC;&#x81F4;SOAP&#x58F0;&#x540D;&#x9E4A;&#x8D77;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;SOAP&#x4E0D;&#x9700;&#x8981;&#x5728;&#x4F01;&#x4E1A;&#x9632;&#x706B;&#x5899;&#x4E0A;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x4FE1;&#x606F;&#x90FD;&#x901A;&#x8FC7;80&#x7AEF;&#x53E3;&#x4F20;&#x9012;&#xFF0C;&#x8FD9;&#x88AB;&#x770B;&#x505A;&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x975E;&#x5E38;&#x5E7C;&#x7A1A;&#x3002;&#xFF09;OMG&#x6570;&#x6B21;&#x52AA;&#x529B;&#x5236;&#x5B9A;CORBA&#x7684;&#x5B89;&#x5168;&#x548C;&#x9632;&#x706B;&#x5899;&#x7A7F;&#x900F;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6280;&#x672F;&#x7F3A;&#x9677;&#x4EE5;&#x53CA;&#x9632;&#x706B;&#x5899;&#x5382;&#x5546;&#x7684;&#x51B7;&#x6F20;&#x800C;&#x653E;&#x5F03;&#x4E86;&#x3002;</p>
<p>&#x7248;&#x672C;&#x3002;&#x90E8;&#x7F72;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x8981;&#x6C42;&#x4E2D;&#x95F4;&#x4EF6;&#x53EF;&#x4EE5;&#x7528;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x7684;&#x65B9;&#x5F0F;&#x9010;&#x6B65;&#x5347;&#x7EA7;&#x3002;CORBA&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x7248;&#x672C;&#x673A;&#x5236;&#xFF08;&#x9664;&#x4E86;&#x6D3E;&#x751F;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x8FD9;&#x5B8C;&#x5168;&#x4E0D;&#x591F;&#xFF09;&#x3002;&#x5347;&#x7EA7;&#x4E00;&#x4E2A;CORBA&#x5E94;&#x7528;&#x5E38;&#x5E38;&#x4F1A;&#x7834;&#x574F;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x7EBF;&#x4E0A;&#x534F;&#x8BAE;&#x3002;&#x8FD9;&#x5F3A;&#x5236;&#x8BB8;&#x591A;&#x5DF2;&#x7ECF;&#x90E8;&#x7F72;&#x7684;&#x5E94;&#x7528;&#x5FC5;&#x987B;&#x4E00;&#x6B21;&#x6027;&#x66FF;&#x6362;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x3002;&#xFF08;CORBA&#x7684;&#x8FD9;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#x5BFC;&#x81F4;SOAP&#x6D41;&#x884C;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;XML&#x6240;&#x8BBE;&#x60F3;&#x7684;&#x677E;&#x6563;&#x8026;&#x5408;&#x672C;&#x8D28;&#x88AB;&#x89C6;&#x4F5C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x4E0E;&#x901A;&#x8FC7;80&#x7AEF;&#x53E3;&#x4F20;&#x8F93;&#x6240;&#x6709;&#x901A;&#x4FE1;&#x7684;&#x60F3;&#x6CD5;&#x4E00;&#x6837;&#x5E7C;&#x7A1A;&#x3002;&#xFF09;</p>
<p>&#x5BF9;&#x4E8E;&#x5546;&#x7528;&#x7684;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6765;&#x8BF4;&#xFF0C;&#x7F3A;&#x4E4F;&#x5B89;&#x5168;&#x548C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x6682;&#x505C;--&#x8BB8;&#x591A;&#x6F5C;&#x5728;&#x7684;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5BA2;&#x6237;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#x62D2;&#x7EDD;&#x4F7F;&#x7528;CORBA&#x3002;</p>
<p>Other Technical Issues&#x5176;&#x5B83;&#x95EE;&#x9898;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5176;&#x5B83;&#x6280;&#x672F;&#x95EE;&#x9898;&#x6298;&#x78E8;CORBA&#xFF0C;&#x5176;&#x4E2D;&#xFF1A;</p>
<p>CORBA&#x4E92;&#x64CD;&#x4F5C;&#x534F;&#x8BAE;&#x7684;&#x8BBE;&#x8BA1;&#x7F3A;&#x9677;&#x4F7F;&#x5F97;&#x5B83;&#x4E0D;&#x53EF;&#x80FD;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x3002;</p>
<p>CORBA&#x7684;&#x7EBF;&#x4E0A;&#x7F16;&#x7801;&#x5305;&#x542B;&#x5927;&#x91CF;&#x7684;&#x5197;&#x4F59;&#xFF0C;&#x4F46;&#x662F;&#x534F;&#x8BAE;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x538B;&#x7F29;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x5927;&#x9762;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x6027;&#x80FD;&#x7F3A;&#x9677;&#x3002;</p>
<p>&#x89C4;&#x8303;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x4E86;&#x7EBF;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x7EBF;&#x7A0B;&#x5E94;&#x7528;&#x662F;&#x5185;&#x5728;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#xFF08;&#x800C;&#x7EBF;&#x7A0B;&#x5BF9;&#x4E8E;&#x5546;&#x4E1A;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x662F;&#x6700;&#x57FA;&#x672C;&#x7684;&#xFF09;&#x3002;CORBA&#x4E0D;&#x652F;&#x6301;&#x5F02;&#x6B65;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5206;&#x6D3E;&#x3002;</p>
<p>C#&#x548C;VB&#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x8BED;&#x8A00;&#x6620;&#x5C04;&#xFF0C;CORBA&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x4E86;.NET&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x5217;&#x8868;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x53D6;&#x6837;&#xFF0C;&#x5728;&#x76F8;&#x5F53;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x88AB;&#x6269;&#x5C55;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x4EC5;&#x4EC5;&#x5F71;&#x54CD;&#x5C0F;&#x90E8;&#x5206;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x589E;&#x52A0;&#x4E86;CORBA&#x7684;&#x8D1F;&#x9762;&#x65B0;&#x95FB;&#x5E76;&#x4E14;&#x9650;&#x5236;&#x4E86;CORBA&#x7684;&#x5E02;&#x573A;</p>
<p>rocedural Issues&#x6D41;&#x7A0B;&#x95EE;&#x9898;</p>
<p>&#x6280;&#x672F;&#x95EE;&#x9898;&#x662F;CORBA&#x5931;&#x5229;&#x7684;&#x6838;&#x5FC3;&#x539F;&#x56E0;&#x3002;&#x4EE4;&#x4EBA;&#x7591;&#x60D1;&#x7684;&#x662F;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5927;&#x7684;&#x8F6F;&#x4EF6;&#x8054;&#x76DF;OMG&#x4E3A;&#x4F55;&#x4F1A;&#x53D7;&#x9650;&#x4E8E;&#x8FD9;&#x4E9B;&#x7F3A;&#x9677;&#x3002;&#x7ED3;&#x679C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6280;&#x672F;&#x95EE;&#x9898;&#x53EA;&#x662F;&#x75C7;&#x72B6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x539F;&#x56E0;&#x3002;</p>
<p>OMG&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x6210;&#x5458;&#x4E00;&#x81F4;&#x540C;&#x610F;&#x6765;&#x53D1;&#x5E03;&#x6280;&#x672F;&#x7684;&#x7EC4;&#x7EC7;&#x3002;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x6210;&#x5458;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x6765;&#x5C06;RFP&#x53D8;&#x6210;&#x89C4;&#x8303;&#x3002;&#x6210;&#x5458;&#x516C;&#x53F8;&#x63D0;&#x4EA4;&#x8349;&#x6848;&#x89C4;&#x8303;&#x4F5C;&#x4E3A;&#x56DE;&#x5E94;&#xFF0C;OMG&#x7684;&#x6210;&#x5458;&#x4EEC;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5C06;&#x63D0;&#x6848;&#x63A5;&#x53D7;&#x4E3A;&#x6807;&#x51C6;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6C11;&#x4E3B;&#x3001;&#x516C;&#x5E73;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x80FD;&#x8D77;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x6807;&#x51C6;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x51C6;&#x5165;&#x8D44;&#x683C;&#x3002;&#x4E00;&#x4E9B;&#x8D21;&#x732E;&#x8005;&#x662F;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4EE4;&#x4EBA;&#x611F;&#x5230;&#x632B;&#x6298;&#x7684;&#x662F;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x6210;&#x5458;&#x51E0;&#x4E4E;&#x4E0D;&#x7406;&#x89E3;&#x4ED6;&#x4EEC;&#x6240;&#x8981;&#x6295;&#x7968;&#x7684;&#x6280;&#x672F;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x5177;&#x6709;&#x4E25;&#x91CD;&#x6280;&#x672F;&#x7F3A;&#x9677;&#x7684;&#x63D0;&#x6848;&#x88AB;&#x91C7;&#x7EB3;&#x4E3A;&#x6807;&#x51C6;&#x3002;</p>
<p> RPF&#x5E38;&#x5E38;&#x63D0;&#x51FA;&#x672A;&#x7ECF;&#x8BC1;&#x660E;&#x7684;&#x6280;&#x672F;&#x3002;OMG&#x7684;&#x6210;&#x5458;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x4E24;&#x7EC4;&#xFF1A;&#x6280;&#x672F;&#x7528;&#x6237;&#x7EC4;&#x548C;&#x6280;&#x672F;&#x5382;&#x5546;&#x7EC4;&#x3002;&#x5178;&#x578B;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x7528;&#x6237;&#x7EC4;&#x60F3;&#x8981;&#x6269;&#x5C55;CORBA&#x4EE5;&#x589E;&#x52A0;&#x67D0;&#x4E2A;&#x80FD;&#x529B;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x5382;&#x5546;&#x80FD;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x63D0;&#x51FA;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x9A71;&#x52A8;&#x4E86;RFP&#x7684;&#x53D1;&#x5E03;&#x3002;&#x4F46;&#x662F;&#x7528;&#x6237;&#x5E38;&#x5E38;&#x5BF9;CORBA&#x5B9E;&#x73B0;&#x7684;&#x5185;&#x90E8;&#x7EC6;&#x8282;&#x77E5;&#x4E4B;&#x751A;&#x5C11;&#x3002;&#x6700;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x5E38;&#x5E38;&#x5BFC;&#x81F4;RFP&#x5305;&#x542B;&#x4E86;&#x5F88;&#x96BE;&#x5B9E;&#x73B0;&#x7684;&#x9700;&#x6C42;&#x6216;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;RFP&#x5F04;&#x5F97;&#x6765;&#x8DDF;&#x8981;&#x6C42;&#x5382;&#x5546;&#x53D8;&#x9B54;&#x6CD5;&#x4E00;&#x6837;&#x8352;&#x8C2C;&#x3002;&#x8FD9;&#x6837;&#x7684;RFP&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x6807;&#x51C6;&#x5316;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x53CD;&#x800C;&#x8BD5;&#x56FE;&#x53BB;&#x9769;&#x65B0;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x6CA1;&#x6709;&#x4EE5;&#x524D;&#x7684;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x5382;&#x5546;&#x5373;&#x4F7F;&#x77E5;&#x9053;&#x6280;&#x672F;&#x6709;&#x7F3A;&#x9677;&#xFF0C;&#x4E5F;&#x4F1A;&#x54CD;&#x5E94;RFP&#x3002;&#x8FD9;&#x79CD;&#x7ED3;&#x679C;&#x4EE4;&#x4EBA;&#x60CA;&#x5947;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5382;&#x5546;&#x4F1A;&#x652F;&#x6301;&#x6709;&#x6280;&#x672F;&#x7F3A;&#x9677;&#x7684;&#x63D0;&#x6848;&#x6210;&#x4E3A;&#x6807;&#x51C6;&#x5462;&#xFF1F;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x5382;&#x5546;&#x4E4B;&#x95F4;&#x5BF9;&#x5BA2;&#x6237;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;&#x6301;&#x7EED;&#x5730;&#x76F8;&#x4E92;&#x78B0;&#x649E;&#x3002;&#x6240;&#x4EE5;&#x5382;&#x5546;&#x4F1A;&#x627F;&#x8BFA;&#x652F;&#x6301;RFP&#xFF0C;&#x5373;&#x4FBF;&#x8FD9;&#x4E9B;RFP&#x5305;&#x542B;&#x4E25;&#x91CD;&#x7684;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x5382;&#x5546;&#x8D62;&#x5F97;&#x7528;&#x6237;&#x597D;&#x611F;&#xFF08;&#x4EE5;&#x53CA;&#x8BA2;&#x5355;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5382;&#x5546;&#x5728;&#x6807;&#x51C6;&#x5316;&#x7684;&#x65F6;&#x5019;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x6709;&#x51B2;&#x7A81;&#x3002;&#x5BF9;&#x4E8E;&#x5382;&#x5546;&#x6765;&#x8BF4;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x662F;&#x4E00;&#x628A;&#x53CC;&#x5203;&#x5251;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x662F;&#x5177;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x80FD;&#x591F;&#x4FC3;&#x8FDB;&#x6280;&#x672F;&#x7684;&#x9500;&#x552E;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x592A;&#x591A;&#x7684;&#x6807;&#x51C6;&#x5316;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6709;&#x5BB3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5382;&#x5546;&#x60F3;&#x8981;&#x4FDD;&#x6301;&#x90A3;&#x4E9B;&#x53EF;&#x4EE5;&#x4F7F;&#x4ED6;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x5728;&#x7ADE;&#x4E89;&#x4E2D;&#x5904;&#x4E8E;&#x4F18;&#x52BF;&#x7684;&#x7279;&#x957F;&#x3002;</p>
<p>&#x5382;&#x5546;&#x6709;&#x65F6;&#x5019;&#x8BD5;&#x56FE;&#x963B;&#x788D;&#x6807;&#x51C6;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x8981;&#x6C42;&#x5382;&#x5546;&#x6539;&#x53D8;&#x4ED6;&#x4EEC;&#x5DF2;&#x6709;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x5E94;&#x8BE5;&#x88AB;&#x6807;&#x51C6;&#x5316;&#x7684;&#x7279;&#x5F81;&#x4FDD;&#x6301;&#x4E86;&#x79C1;&#x6709;&#x5316;&#xFF0C;&#x6216;&#x8005;&#x6A21;&#x7CCA;&#x5730;&#x6307;&#x5B9A;&#x800C;&#x6BEB;&#x65E0;&#x7528;&#x5904;&#x3002;&#x4E00;&#x4E9B;&#x5382;&#x5546;&#x4E5F;&#x5FFD;&#x7565;&#x4E86;&#x6807;&#x51C6;&#x7279;&#x5F81;&#x548C;&#x79C1;&#x6709;&#x7279;&#x5F81;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x6B64;&#x5BA2;&#x6237;&#x8FF7;&#x5931;&#x5728;&#x5B9E;&#x73B0;&#x76F8;&#x5173;&#x7684;&#x533A;&#x57DF;&#x800C;&#x6BEB;&#x65E0;&#x8B66;&#x793A;&#x3002;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x5C06;CORBA&#x5E94;&#x7528;&#x79FB;&#x690D;&#x5230;&#x4E0D;&#x540C;&#x5382;&#x5546;&#x7684;&#x5B9E;&#x73B0;&#x4E0A;&#x4F1A;&#x82B1;&#x8D39;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x4EE3;&#x4EF7;&#xFF1B;&#x5BA2;&#x6237;&#x5E38;&#x5E38;&#x53D1;&#x73B0;&#x5C3D;&#x7BA1;&#x6709;&#x5F88;&#x591A;&#x6807;&#x51C6;&#xFF0C;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x8FD8;&#x662F;&#x88AB;&#x9501;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4EA7;&#x54C1;&#x4E0A;&#x3002;</p>
<p>RFP&#x5E38;&#x5E38;&#x7531;&#x51E0;&#x4E2A;&#x8349;&#x6848;&#x89C4;&#x8303;&#x6765;&#x56DE;&#x5E94;&#x3002;OMG&#x6210;&#x5458;&#x901A;&#x5E38;&#x7684;&#x56DE;&#x5E94;&#x4E0D;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x6C42;&#x63D0;&#x4EA4;&#x8005;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x7279;&#x5F81;&#x5408;&#x5E76;&#x4E3A;&#x5355;&#x4E00;&#x7684;&#x89C4;&#x8303;&#x3002;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x662F;&#x5BFC;&#x81F4;CORBA&#x590D;&#x6742;&#x6027;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x5728;&#x5408;&#x5E76;&#x7279;&#x5F81;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x89C4;&#x8303;&#x6700;&#x7EC8;&#x88AB;&#x5B9A;&#x683C;&#x4E3A;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x4EBA;&#x63D0;&#x51FA;&#x7684;&#x7279;&#x5F81;&#x7684;&#x53A8;&#x623F;&#x6D17;&#x7897;&#x69FD;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x4EC5;&#x4F7F;&#x5F97;&#x89C4;&#x8303;&#x6BEB;&#x65E0;&#x5FC5;&#x8981;&#x5730;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x4E5F;&#x589E;&#x52A0;&#x4E86;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x98CE;&#x9669;&#xFF1A;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x76F8;&#x4E92;&#x7684;&#x4EA4;&#x4E92;&#x4E2D;&#x5F15;&#x8D77;&#x8BED;&#x4E49;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x4E3B;&#x8981;&#x7684;&#x5382;&#x5546;&#x5076;&#x5C14;&#x4F1A;&#x505C;&#x6B62;&#x4F1A;&#x8BAE;&#xFF0C;&#x76F4;&#x5230;&#x4ED6;&#x4EEC;&#x89C6;&#x4F5C;&#x5BA0;&#x7269;&#x7684;&#x90A3;&#x4E9B;&#x7279;&#x5F81;&#x88AB;&#x5408;&#x5E76;&#x8FDB;&#x6807;&#x51C6;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x6280;&#x672F;&#x8FC7;&#x7A0B;&#x9000;&#x5316;&#x6210;&#x4E86;&#x7ACB;&#x573A;&#x6DF7;&#x6218;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x8FDD;&#x53CD;&#x89C4;&#x5219;&#x7684;&#x59A5;&#x534F;&#xFF0C;&#x5EF6;&#x8FDF;&#x4E86;&#x89C4;&#x8303;&#x7684;&#x53D1;&#x5E03;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5BF9;&#x4E8E;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x7684;&#x52AA;&#x529B;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x6DF7;&#x6218;&#x7684;&#x53D7;&#x5BB3;&#x8005;&#xFF0C;&#x6B63;&#x5982;&#x7B2C;&#x4E00;&#x6B21;&#x5BF9;C++&#x6620;&#x5C04;&#x7684;&#x52AA;&#x529B;&#x4E00;&#x6837;&#x3002;&#x6240;&#x6709;&#x7684;&#x52AA;&#x529B;&#x90FD;&#x9677;&#x5165;&#x56F0;&#x5883;&#xFF0C;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x88AB;&#x653E;&#x5F03;&#xFF0C;&#x968F;&#x540E;&#x518D;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x3002;</p>
<p>OMG&#x6CA1;&#x6709;&#x8981;&#x6C42;&#x89C4;&#x8303;&#x7684;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#x88AB;&#x91C7;&#x7EB3;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x5BFC;&#x81F4;&#x89C4;&#x8303;&#x6210;&#x4E3A;&#x7A7A;&#x4E2D;&#x57CE;&#x5821;&#x3002;&#x597D;&#x51E0;&#x6B21;OMG&#x53D1;&#x5E03;&#x4E86;&#x540E;&#x6765;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x90E8;&#x5206;&#x4E0D;&#x53EF;&#x5B9E;&#x73B0;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x5B9E;&#x73B0;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x5176;&#x4E2D;&#x4E25;&#x91CD;&#x7684;&#x6280;&#x672F;&#x7F3A;&#x9677;&#x3002;&#x4E5F;&#x6709;&#x5176;&#x5B83;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x89C4;&#x8303;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5F3A;&#x52A0;&#x4E86;&#x8BB8;&#x591A;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x8D1F;&#x62C5;&#x3002;&#x8FD9;&#x6837;&#x53CD;&#x590D;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x4EE4;&#x4EBA;&#x5C34;&#x5C2C;&#xFF0C;&#x78E8;&#x6389;&#x4E86;&#x5BA2;&#x6237;&#x7684;&#x4FE1;&#x5FC3;&#x3002;&#x5BF9;&#x4E8E;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#x7684;&#x8981;&#x6C42;&#x4F1A;&#x5F3A;&#x5236;&#x63D0;&#x4EA4;&#x8005;&#x5B9E;&#x73B0;&#x4ED6;&#x4EEC;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8BB8;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6574;&#x4F53;&#x4E0A;&#xFF0C;OMG&#x7684;&#x6280;&#x672F;&#x91C7;&#x7EB3;&#x8FC7;&#x7A0B;&#x5E94;&#x88AB;&#x89C6;&#x4F5C;CORBA&#x5931;&#x5229;&#x7684;&#x6838;&#x5FC3;&#x539F;&#x56E0;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x9F13;&#x52B1;&#x4E86;&#x59D4;&#x5458;&#x4F1A;&#x548C;&#x5404;&#x65B9;&#x7ACB;&#x573A;&#x79FB;&#x52A8;&#x5230;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x70B9;&#x5F88;&#x96BE;&#x83B7;&#x5F97;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x5E73;&#x5E38;&#x6C34;&#x5E73;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x6770;&#x51FA;&#x7684;&#x6280;&#x672F;&#x8868;&#x73B0;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x589E;&#x52A0;&#x8131;&#x8282;&#x7684;&#x6280;&#x672F;&#x7279;&#x5F81;&#x5BFC;&#x81F4;&#x4E86;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x89C2;&#x70B9;&#x7684;&#x9010;&#x6B65;&#x8150;&#x8680;&#x3002;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5173;&#x4E8E;&#x4E0D;&#x900F;&#x660E;&#x5F15;&#x7528;&#x7684;&#x6982;&#x5FF5;&#x5728;2000&#x5E74;&#x4E00;&#x6B21;&#x89C4;&#x8303;&#x7684;&#x66F4;&#x65B0;&#x4E2D;&#x88AB;&#x5FFD;&#x7565;&#x6389;&#x4E86;&#xFF0C;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x5F15;&#x7528;&#x5F00;&#x59CB;&#x900F;&#x660E;&#xFF0C;&#x4F46;&#x662F;API&#x4ECD;&#x7136;&#x80CC;&#x8D1F;&#x7740;&#x5C06;&#x5F15;&#x7528;&#x89C6;&#x4F5C;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x91CD;&#x62C5;&#xFF09;&#x3002;</p>
<p>CORBA&#x7684;&#x51E0;&#x4E2A;&#x6280;&#x672F;&#x7F3A;&#x9677;&#x7D2F;&#x79EF;&#x5230;&#x4E00;&#x4E2A;&#x70B9;&#x4E0A;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x4FEE;&#x590D;&#x6216;&#x8005;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x800C;&#x4E0D;&#x7834;&#x574F;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF;&#x6B21;CORBA&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x534F;&#x8BAE;&#x7684;&#x4FEE;&#x8BA2;&#x90FD;&#x5FC5;&#x987B;&#x505A;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x8BB8;&#x591A;&#x8865;&#x4E01;&#x548C;&#x6F84;&#x6E05;&#x8981;&#x91CD;&#x5199;&#x51E0;&#x6B21;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x7279;&#x5F81;&#x4EA4;&#x4E92;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x589E;&#x52A0;&#x3002;</p>
<p>Can We Learn From the Past?&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8FC7;&#x53BB;&#x5B66;&#x5230;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x4E00;&#x4E2A;&#x6C11;&#x4E3B;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;OMG&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x521B;&#x5EFA;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x6765;&#x8BF4;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x5408;&#x9002;&#x7684;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x6D41;&#x7A0B;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5DE5;&#x4E1A;&#x754C;&#x4ECD;&#x7136;&#x503E;&#x5411;&#x4E8E;&#x4F9D;&#x9760;&#x5927;&#x7684;&#x7EC4;&#x7EC7;&#x6765;&#x751F;&#x4EA7;&#x6280;&#x672F;&#x3002;Web&#x670D;&#x52A1;&#xFF0C;&#x5F53;&#x524D;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x94F6;&#x5F39;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E;OMG&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x5728;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#xFF0C;&#x4E5F;&#x53D7;&#x82E6;&#x4E8E;&#x6DF7;&#x6218;&#x3001;&#x5206;&#x88C2;&#x3001;&#x7F3A;&#x4E4F;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x81F4;&#x3001;&#x7531;&#x59D4;&#x5458;&#x4F1A;&#x6765;&#x8BBE;&#x8BA1;&#x4EE5;&#x53CA;&#x7279;&#x5F81;&#x81A8;&#x80C0;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x770B;&#x4E0A;&#x53BB;Web&#x670D;&#x52A1;&#x4E5F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7ECF;&#x5386;&#x7C7B;&#x4F3C;&#x4E8E;CORBA&#x7684;&#x5386;&#x53F2;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x91C7;&#x53D6;&#x4EC0;&#x4E48;&#x6B65;&#x9AA4;&#x6765;&#x5F00;&#x5C55;&#x8F83;&#x597D;&#x7684;&#x6807;&#x51C6;&#x5316;&#x8FC7;&#x7A0B;&#x4EE5;&#x53CA;&#x4EA7;&#x51FA;&#x8F83;&#x597D;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x5462;&#xFF1F;&#x8003;&#x8651;&#x5230;&#x6D41;&#x7A0B;&#x7684;&#x5931;&#x8D25;&#x662F;&#x6280;&#x672F;&#x5931;&#x8D25;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x81F3;&#x5C11;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x63AA;&#x65BD;&#xFF1A;</p>
<p>&#x6807;&#x51C6;&#x5316;&#x7EC4;&#x7EC7;&#x9700;&#x8981;&#x94C1;&#x7532;&#x7EAA;&#x5F8B;&#x6765;&#x786E;&#x4FDD;&#x4ED6;&#x4EEC;&#x6807;&#x51C6;&#x5316;&#x7684;&#x662F;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;&#x5728;&#x6807;&#x51C6;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CA1;&#x6709;&#x9769;&#x65B0;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x628A;&#x201C;&#x4EC5;&#x4EC5;&#x662F;&#x989D;&#x5916;&#x7684;&#x5C0F;&#x7279;&#x5F81;&#x201D;&#x653E;&#x8FDB;&#x6807;&#x51C6;&#xFF0C;&#x5C06;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x5F15;&#x8D77;&#x4E0D;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x5C3D;&#x7BA1;&#x76EE;&#x7684;&#x662F;&#x597D;&#x7684;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#x7684;&#x6807;&#x51C6;&#x4E0D;&#x5E94;&#x88AB;&#x901A;&#x8FC7;&#x3002;&#x8FD9;&#x4F1A;&#x7ED9;&#x5C06;&#x8981;&#x6807;&#x51C6;&#x5316;&#x7684;&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x9996;&#x8981;&#x7684;&#x5065;&#x5168;&#x68C0;&#x67E5;&#x3002;&#xFF08;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x806A;&#x660E;&#x5230;&#x4E00;&#x770B;&#x5230;&#x89C4;&#x8303;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x89C4;&#x8303;&#x4E0D;&#x5305;&#x542B;&#x9690;&#x85CF;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x8FC7;&#x8FD9;&#x4E2A;&#x89C4;&#x8303;&#x7684;&#x8BDD;&#xFF09;</p>
<p>&#x6CA1;&#x6709;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x51E0;&#x4E2A;&#x771F;&#x6B63;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x7A0B;&#xFF0C;&#x6807;&#x51C6;&#x4E0D;&#x5E94;&#x88AB;&#x901A;&#x8FC7;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x6E05;&#x9664;&#x8BBE;&#x8BA1;&#x7CDF;&#x7CD5;&#x7684;API&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF1A;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x770B;&#x89C1;API&#x7684;&#x5B9E;&#x73B0;&#x8005;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x4F7F;&#x7528;&#x8FC7;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x53EF;&#x7528;&#x6027;&#x4E0D;&#x9AD8;&#x7684;&#x707E;&#x96BE;&#x6027;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x6BD4;&#x8D77;&#x5DE5;&#x4E1A;&#x6807;&#x51C6;&#x5316;&#x7EC4;&#x7EC7;&#x6765;&#x8BF4;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x5219;&#x575A;&#x6301;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x505A;&#x4E86;&#x8BB8;&#x591A;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5F00;&#x6E90;&#x9769;&#x547D;&#x5E38;&#x5E38;&#x9075;&#x4ECE;&#x8FBE;&#x5C14;&#x6587;&#x7269;&#x7ADE;&#x5929;&#x62E9;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5B9E;&#x73B0;&#x4ED6;&#x4EEC;&#x5173;&#x4E8E;&#x67D0;&#x4E2A;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x4EBA;&#x8BD5;&#x56FE;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x6216;&#x8005;&#x6279;&#x8BC4;&#x6216;&#x8005;&#x63D0;&#x9AD8;&#x5B83;&#x4EEC;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x8F6F;&#x4EF6;&#x5728;&#x76F8;&#x5F53;&#x7684;&#x7A0B;&#x5EA6;&#x4E0A;&#x88AB;&#x7EC6;&#x5BDF;&#x548C;&#x6D4B;&#x8BD5;&#x8FC7;&#xFF0C;&#x4EC5;&#x4EC5;&#x6700;&#x201C;&#x5408;&#x9002;&#x201D;&#x7248;&#x672C;&#x751F;&#x5B58;&#x4E86;&#x4E0B;&#x6765;&#x3002;&#xFF08;&#x8BB8;&#x591A;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x89C4;&#x8303;&#x5316;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x901A;&#x8FC7;&#x4EA4;&#x66FF;&#x7684;&#x8BD5;&#x9A8C;&#x7248;&#x672C;&#x548C;&#x4EA7;&#x54C1;&#x53D1;&#x5E03;&#xFF1A;&#x8BD5;&#x9A8C;&#x7248;&#x672C;&#x7684;&#x53D1;&#x5E03;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x5E8A;&#x548C;&#x8FDB;&#x5316;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#xFF09;</p>
<p>&#x4E3A;&#x4E86;&#x521B;&#x9020;&#x6709;&#x8D28;&#x91CF;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B66;&#x4F1A;&#x8BF4;&#x201C;&#x4E0D;&#x201D;&#x5E38;&#x5E38;&#x6BD4;&#x8D77;&#x8BF4;&#x201C;&#x662F;&#x201D;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x3002;&#x5F00;&#x6E90;&#x901A;&#x8FC7;&#x201C;&#x6148;&#x5584;&#x4E13;&#x653F;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;&#x5373;&#x4F7F;&#x8BB8;&#x591A;&#x4EBA;&#x505A;&#x51FA;&#x4E86;&#x8D21;&#x732E;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E13;&#x5BB6;&#xFF08;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x4E13;&#x5BB6;&#x56E2;&#xFF09;&#x6700;&#x7EC8;&#x4F1A;&#x62D2;&#x7EDD;&#x6216;&#x8005;&#x63A5;&#x53D7;&#x6BCF;&#x4E2A;&#x63D0;&#x4EA4;&#x7684;&#x53D8;&#x5316;&#x3002;&#x8FD9;&#x4FDD;&#x6301;&#x4E86;&#x539F;&#x59CB;&#x7684;&#x4F53;&#x7CFB;&#x89C6;&#x89D2;&#xFF0C;&#x505C;&#x6B62;&#x4E86;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x201C;&#x592A;&#x591A;&#x7684;&#x53A8;&#x5B50;&#x4F1A;&#x574F;&#x4E86;&#x4E00;&#x9505;&#x6C64;&#x201D;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x5F00;&#x6E90;&#x5B9E;&#x8DF5;&#x7684;&#x4E2D;&#x5FC3;&#x662F;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5047;&#x8BBE;&#xFF1A;&#x5408;&#x4F5C;&#x548C;&#x4FE1;&#x4EFB;&#x3002;&#x6CA1;&#x6709;&#x5408;&#x4F5C;&#xFF0C;&#x6F14;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#x4E0D;&#x80FD;&#x5DE5;&#x4F5C;&#xFF1B;&#x6CA1;&#x6709;&#x4FE1;&#x4EFB;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x4E13;&#x5BB6;&#x5C0F;&#x96C6;&#x56E2;&#x80FD;&#x505A;&#x51FA;&#x6700;&#x7EC8;&#x7684;&#x4EF2;&#x88C1;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6B63;&#x597D;&#x4F7F;&#x8F6F;&#x4EF6;&#x7EC4;&#x7EC7;&#x627E;&#x5230;&#x4E86;&#x751F;&#x5B58;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5C06;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#x7684;&#x5382;&#x5546;&#x548C;&#x5BA2;&#x6237;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x4EA7;&#x51FA;&#x9AD8;&#x54C1;&#x8D28;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x8FD9;&#x662F;&#x5E7C;&#x7A1A;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x5546;&#x4E1A;&#x7684;&#x672C;&#x8D28;&#x5C06;&#x4F7F;&#x5F97;&#x5408;&#x4F5C;&#x548C;&#x4FE1;&#x4EFB;&#x5728;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x5927;&#x8111;&#x4E2D;&#x662F;&#x6700;&#x540E;&#x8003;&#x8651;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8F6F;&#x4EF6;&#x7EC4;&#x7EC7;&#x5BF9;&#x4E8E;&#x6F14;&#x8FDB;&#x8FC7;&#x7A0B;&#x7684;&#x8D21;&#x732E;&#x4E0E;&#x5F00;&#x6E90;&#x5DE5;&#x7A0B;&#x4E00;&#x6837;&#x3002;&#x53EA;&#x662F;&#x5546;&#x4E1A;&#x5E02;&#x573A;&#x6210;&#x4E3A;&#x4E86;&#x6D4B;&#x8BD5;&#x5E8A;&#x548C;&#x6F14;&#x8FDB;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5BA2;&#x6237;&#xFF0C;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x6765;&#x626E;&#x6F14;&#xFF08;&#x4E00;&#x822C;&#x4E0D;&#x600E;&#x4E48;&#x6148;&#x5584;&#xFF09;&#x7684;&#x4EF2;&#x88C1;&#x8005;&#x3002;&#x8FD9;&#x8DDF;&#x5DE5;&#x4E1A;&#x754C;&#x629B;&#x51FA;&#x94F6;&#x5F39;&#xFF0C;&#x5BA2;&#x6237;&#x50CF;&#x65C5;&#x9F20;&#x4E00;&#x6837;&#x8DF3;&#x8FC7;&#x60AC;&#x5D16;&#x4E00;&#x6837;&#x3002;&#x9664;&#x975E;&#x6211;&#x4EEC;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5426;&#x5219;&#x7EDF;&#x4E00;&#x7684;&#x5546;&#x7528;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x50CF;&#x8FC7;&#x53BB;&#x4E00;&#x6837;&#x4E45;&#x4E45;&#x4E0D;&#x80FD;&#x5230;&#x6765;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../corbaxiang-guan.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Corba相关">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Corba兴衰史","level":"1.3.1","depth":2,"next":{"title":"JavaEE相关","level":"1.4","depth":1,"ref":"","articles":[]},"previous":{"title":"Corba相关","level":"1.3","depth":1,"path":"corbaxiang-guan.md","ref":"corbaxiang-guan.md","articles":[{"title":"Corba兴衰史","level":"1.3.1","depth":2,"path":"corbaxiang-guan/corbaxing-shuai-shi.md","ref":"corbaxiang-guan/corbaxing-shuai-shi.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"corbaxiang-guan/corbaxing-shuai-shi.md","mtime":"2019-02-21T07:27:06.956Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-02-21T07:31:29.364Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

