
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>中间件的发展趋势 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../corbaxiang-guan.html" />
    
    
    <link rel="prev" href="zhong-jian-jian-ding-yi.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1.html">
            
                <a href="../chapter1.html">
            
                    
                    中间件发展史
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="zhong-jian-jian-ding-yi.html">
            
                <a href="zhong-jian-jian-ding-yi.html">
            
                    
                    中间件定义
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="zhong-jian-jian-de-fa-zhan-qu-shi.html">
            
                <a href="zhong-jian-jian-de-fa-zhan-qu-shi.html">
            
                    
                    中间件的发展趋势
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../corbaxiang-guan.html">
            
                <a href="../corbaxiang-guan.html">
            
                    
                    Corba相关
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../corbaxiang-guan/corbaxing-shuai-shi.html">
            
                <a href="../corbaxiang-guan/corbaxing-shuai-shi.html">
            
                    
                    Corba兴衰史
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    JavaEE相关
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    微软中间件相关
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    Web框架
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" >
            
                <span>
            
                    
                    SSH
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" >
            
                <span>
            
                    
                    SSM
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" >
            
                <span>
            
                    
                    Python相关
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >中间件的发展趋势</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;">&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;</h2>
<p>&#x4E2D;&#x95F4;&#x4EF6;&#x662F;&#x4F34;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7684;&#x53D1;&#x5C55;&#x800C;&#x9010;&#x6E10;&#x6210;&#x957F;&#x8D77;&#x6765;&#x7684;&#x6280;&#x672F;&#x4F53;&#x7CFB;&#x3002;&#x6700;&#x521D;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x53D1;&#x5C55;&#x9A71;&#x52A8;&#x529B;&#x662F;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7684;&#x6807;&#x51C6;&#x7684;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x6765;&#x5C4F;&#x853D;&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x73AF;&#x5883;&#x548C;API&#x5DEE;&#x5F02;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x201C;&#x4E2D;&#x95F4;&#x201D;&#x7684;&#x8FD9;&#x4E00;&#x5C42;&#x53EB;&#x4E2D;&#x95F4;&#x4EF6;&#x3002;&#x4F46;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x3001;&#x5B89;&#x5168;&#x3001;&#x4E8B;&#x52A1;&#x7684;&#x6027;&#x80FD;&#x3001;&#x4F20;&#x8F93;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3001;&#x8BED;&#x4E49;&#x7684;&#x89E3;&#x6790;&#x3001;&#x6570;&#x636E;&#x548C;&#x5E94;&#x7528;&#x7684;&#x6574;&#x5408;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x53D8;&#x6210;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x9A71;&#x52A8;&#x56E0;&#x7D20;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x76F8;&#x7EE7;&#x51FA;&#x73B0;&#x4E86;&#x89E3;&#x51B3;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x95F4;&#x4EF6;&#x3001;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x3001;&#x96C6;&#x6210;&#x4E2D;&#x95F4;&#x4EF6;&#x7B49;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x6027;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x548C;&#x4EA7;&#x54C1;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3001;&#x96C6;&#x6210;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x8FD0;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x7531;&#x4E8E;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x6D89;&#x53CA;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7684;&#x5404;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x6DB5;&#x76D6;&#x4ECE;&#x57FA;&#x7840;&#x901A;&#x8BAF;&#x3001;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5230;&#x5E94;&#x7528;&#x96C6;&#x6210;&#x7B49;&#x4F17;&#x591A;&#x7684;&#x73AF;&#x8282;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x5448;&#x73B0;&#x51FA;&#x591A;&#x6837;&#x5316;&#x7684;&#x53D1;&#x5C55;&#x7279;&#x70B9;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4E2D;&#x95F4;&#x4EF6;&#x5728;&#x652F;&#x6301;&#x76F8;&#x5BF9;&#x5C01;&#x95ED;&#x3001;&#x9759;&#x6001;&#x3001;&#x7A33;&#x5B9A;&#x3001;&#x6613;&#x63A7;&#x7684;&#x4F01;&#x4E1A;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4F01;&#x4E1A;&#x8BA1;&#x7B97;&#x548C;&#x4FE1;&#x606F;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x65B9;&#x9762;&#x53D6;&#x5F97;&#x4E86;&#x5DE8;&#x5927;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x5728;&#x65B0;&#x65F6;&#x671F;&#x4EE5;&#x5F00;&#x653E;&#x3001;&#x52A8;&#x6001;&#x3001;&#x591A;&#x53D8;&#x7684;&#x4E92;&#x8054;&#x7F51;&#xFF08;Internet&#xFF09;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x51B2;&#x51FB;&#x4E0B;&#xFF0C;&#x8FD8;&#x662F;&#x663E;&#x9732;&#x51FA;&#x4E86;&#x5B83;&#x7684;&#x56FA;&#x6709;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x5982;&#x529F;&#x80FD;&#x8F83;&#x4E3A;&#x4E13;&#x4E00;&#x5316;&#xFF0C;&#x4EA7;&#x54C1;&#x548C;&#x6280;&#x672F;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x8F83;&#x5927;&#x7684;&#x5F02;&#x6784;&#x6027;&#xFF0C;&#x8DE8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x96C6;&#x6210;&#x548C;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#xFF0C;&#x50F5;&#x5316;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7F3A;&#x4E4F;&#x968F;&#x9700;&#x5E94;&#x53D8;&#x80FD;&#x529B;&#x7B49;&#x7B49;&#xFF0C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x8BA1;&#x7B97;&#x5E26;&#x6765;&#x7684;&#x5DE8;&#x5927;&#x6311;&#x6218;&#x9762;&#x524D;&#x663E;&#x5F97;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#xFF0C;&#x65F6;&#x4EE3;&#x8981;&#x6C42;&#x65B0;&#x7684;&#x6280;&#x672F;&#x53D8;&#x9769;&#x3002;</p>
<p>&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#xFF0C;&#x5C06;&#x805A;&#x7126;&#x4E8E;&#x6D88;&#x9664;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#xFF0C;&#x63A8;&#x52A8;&#x65E0;&#x8FB9;&#x754C;&#x4FE1;&#x606F;&#x6D41;&#xFF0C;&#x652F;&#x6491;&#x5F00;&#x653E;&#x3001;&#x52A8;&#x6001;&#x3001;&#x591A;&#x53D8;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x590D;&#x6742;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B9E;&#x73B0;&#x5BF9;&#x5206;&#x5E03;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x4E4B;&#x4E0A;&#x7684;&#x5404;&#x79CD;&#x81EA;&#x6CBB;&#x4FE1;&#x606F;&#x8D44;&#x6E90;&#xFF08;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3001;&#x6570;&#x636E;&#x8D44;&#x6E90;&#x3001;&#x670D;&#x52A1;&#x8D44;&#x6E90;&#x3001;&#x8F6F;&#x4EF6;&#x8D44;&#x6E90;&#xFF09;&#x7684;&#x7B80;&#x5355;&#x3001;&#x6807;&#x51C6;&#x3001;&#x5FEB;&#x901F;&#x3001;&#x7075;&#x6D3B;&#x3001;&#x53EF;&#x4FE1;&#x3001;&#x9AD8;&#x6548;&#x80FD;&#x53CA;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x96C6;&#x6210;&#x3001;&#x534F;&#x540C;&#x548C;&#x7EFC;&#x5408;&#x5229;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x7EC4;&#x7EC7;&#x7684;IT&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E1A;&#x52A1;&#x654F;&#x6377;&#x6027;&#xFF0C;&#x964D;&#x4F4E;&#x603B;&#x4F53;&#x8FD0;&#x7EF4;&#x6210;&#x672C;&#xFF0C;&#x4FC3;&#x8FDB;IT&#x4E0E;&#x4E1A;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x5339;&#x914D;&#x3002;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x6B63;&#x5728;&#x5448;&#x73B0;&#x51FA;&#x4E1A;&#x52A1;&#x5316;&#x3001;&#x670D;&#x52A1;&#x5316;&#x3001;&#x4E00;&#x4F53;&#x5316;&#x3001;&#x865A;&#x62DF;&#x5316;&#x7B49;&#x8BF8;&#x591A;&#x65B0;&#x7684;&#x91CD;&#x8981;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x3002;</p>
<p><strong>1.&#x4E1A;&#x52A1;&#x5316;&#xFF1A;&#x4E2D;&#x95F4;&#x4EF6;&#x6B63;&#x5728;&#x201C;&#x53D8;&#x539A;&#x53D8;&#x5BBD;&#x201D;</strong></p>
<p>&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x672C;&#x8D28;&#x7279;&#x5F81;&#x662F;&#x5BF9;&#x8BA1;&#x7B97;&#x73AF;&#x5883;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x5BF9;&#x5E94;&#x7528;&#x5171;&#x6027;&#x7684;&#x51DD;&#x70BC;&#x3002;&#x5341;&#x5E74;&#x6765;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x53D1;&#x5C55;&#x591A;&#x5728;&#x8BA1;&#x7B97;&#x73AF;&#x5883;&#x7684;&#x62BD;&#x8C61;&#x4E0A;&#x3002;&#x76EE;&#x524D;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x4E0D;&#x540C;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x62BD;&#x53D6;&#x5206;&#x5E03;&#x7CFB;&#x7EDF;&#x6784;&#x9020;&#x4E2D;&#x7684;&#x5171;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x5C01;&#x88C5;&#x8FD9;&#x4E9B;&#x5171;&#x6027;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x673A;&#x5236;&#xFF0C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x7B80;&#x5355;&#x7EDF;&#x4E00;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x5171;&#x6027;&#x95EE;&#x9898;&#x65F6;&#x7684;&#x96BE;&#x5EA6;&#x548C;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5176;&#x663E;&#x8457;&#x7279;&#x70B9;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x7684;&#x6280;&#x672F;&#x5BFC;&#x5411;&#xFF0C;&#x5B83;&#x5178;&#x578B;&#x5730;&#x662F;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7B49;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#x80FD;&#x529B;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x5C01;&#x88C5;&#xFF0C;&#x5176;&#x5173;&#x6CE8;&#x4E3B;&#x8981;&#x805A;&#x7126;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x6784;&#x5EFA;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image001.jpg" alt=""></p>
<p>&#x4E2D;&#x95F4;&#x4EF6;&#x53D8;&#x5BBD;&#x53D8;&#x539A;</p>
<p>&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x5C06;&#x88AB;&#x62BD;&#x8C61;&#x5F62;&#x6210;&#x6807;&#x51C6;&#x7684;&#x5E73;&#x53F0;&#x670D;&#x52A1;&#xFF0C;&#x52A0;&#x5165;&#x5230;&#x4E2D;&#x95F4;&#x4EF6;&#x4E4B;&#x4E2D;&#xFF0C;&#x6210;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x4E1A;&#x52A1;&#x5316;&#x4EE3;&#x8868;&#x4E86;&#x4E2D;&#x95F4;&#x4EF6;&#x5BF9;&#x590D;&#x6742;&#x4E1A;&#x52A1;&#x652F;&#x6301;&#x65B9;&#x9762;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF0C;&#x5373;&#xFF0C;&#x4ECE;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x6280;&#x672F;&#x9A71;&#x52A8;&#x8F6C;&#x53D8;&#x4E3A;&#x66F4;&#x591A;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x7684;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x4E1A;&#x52A1;&#x9A71;&#x52A8;&#xFF0C;&#x51DD;&#x7EC3;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x548C;&#x4E1A;&#x52A1;&#x6A21;&#x5F0F;&#xFF0C;&#x652F;&#x6301;&#x590D;&#x6742;&#x4E1A;&#x52A1;&#x7684;&#x5F00;&#x653E;&#x5F0F;&#x591A;&#x65B9;&#x534F;&#x540C;&#x548C;&#x6309;&#x9700;&#x96C6;&#x6210;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x5BF9;&#x7EC4;&#x7EC7;&#x800C;&#x8A00;&#xFF0C;&#x901A;&#x8FC7;IT&#x5BF9;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x7684;&#x7BA1;&#x7406;&#x53CA;&#x5229;&#x7528;&#x662F;&#x5176;&#x4E1A;&#x52A1;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#xFF0C;IT&#x662F;&#x8981;&#x4E3A;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x7684;&#x3002;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x4F5C;&#x4E3A;&#x4F01;&#x4E1A;&#x8BA1;&#x7B97;&#x7684;&#x6838;&#x5FC3;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x4E00;&#xFF0C;&#x4EC5;&#x4EC5;&#x5173;&#x6CE8;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5F53;&#x4ECA;&#x5168;&#x7403;&#x5316;&#x8D8B;&#x52BF;&#x4E4B;&#x4E2D;&#x8C0B;&#x6C42;&#x751F;&#x5B58;&#x548C;&#x53D1;&#x5C55;&#xFF0C;IT&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x53CA;&#x5176;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5BF9;&#x6218;&#x7565;&#x548C;&#x4E1A;&#x52A1;&#x7684;&#x6709;&#x6548;&#x652F;&#x6301;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F5C;&#x4E3A;&#x5171;&#x6027;&#x7684;&#x51DD;&#x7EC3;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x4E0D;&#x4EC5;&#x8981;&#x4ECE;&#x5E95;&#x5C42;&#x7684;&#x6280;&#x672F;&#x5165;&#x624B;&#xFF0C;&#x5C06;&#x5171;&#x6027;&#x6280;&#x672F;&#x7684;&#x7279;&#x5F81;&#x62BD;&#x8C61;&#x8FDB;&#x4E2D;&#x95F4;&#x5C42;&#xFF0C;&#x8FD8;&#x8981;&#x66F4;&#x591A;&#x5730;&#x628A;&#x76EE;&#x5149;&#x6295;&#x5411;&#x5230;&#x4E1A;&#x52A1;&#x5C42;&#x9762;&#x4E0A;&#x6765;&#xFF0C;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x9A71;&#x52A8;&#x81EA;&#x8EAB;&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x5373;&#xFF0C;&#x4E0D;&#x65AD;&#x51FA;&#x73B0;&#x7684;&#x65B0;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x8981;&#x9A71;&#x52A8;&#x4E86;&#x5E94;&#x7528;&#x6A21;&#x5F0F;&#x548C;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x8FDB;&#x800C;&#x8981;&#x6C42;&#x4E2D;&#x95F4;&#x4EF6;&#x4E0D;&#x65AD;&#x5730;&#x51DD;&#x7EC3;&#x66F4;&#x591A;&#x7684;&#x4E1A;&#x52A1;&#x5171;&#x6027;&#xFF0C;&#x63D0;&#x4F9B;&#x9488;&#x5BF9;&#x6027;&#x652F;&#x6491;&#x673A;&#x5236;&#x3002;&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x8FD9;&#x4E00;&#x9700;&#x6C42;&#x8D8B;&#x52BF;&#x6108;&#x53D1;&#x660E;&#x663E;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4E1A;&#x52A1;&#x548C;&#x5E94;&#x7528;&#x6A21;&#x5F0F;&#x88AB;&#x4E0D;&#x65AD;&#x5730;&#x62BD;&#x8C61;&#x8FDB;&#x5165;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x5982;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x6D41;&#x3001;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x3001;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x3001;&#x4EA4;&#x4E92;&#x5E94;&#x7528;&#x7B49;&#x7B49;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x662F;&#x4E2D;&#x95F4;&#x4EF6;&#x51DD;&#x7EC3;&#x7684;&#x5171;&#x6027;&#x529F;&#x80FD;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5F62;&#x8C61;&#x7684;&#x770B;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x201C;&#x539A;&#x201D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x4EE5;&#x4E92;&#x8054;&#x7F51;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x65B0;&#x6280;&#x672F;&#x63A8;&#x52A8;&#x4E0B;&#xFF0C;&#x4F34;&#x968F;&#x5168;&#x7403;&#x5316;&#x7684;&#x811A;&#x6B65;&#x4EE5;&#x53CA;&#x56FD;&#x6C11;&#x7ECF;&#x6D4E;&#x548C;&#x56FD;&#x5BB6;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x7684;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x4F01;&#x4E1A;/&#x653F;&#x5E9C;&#x7684;&#x4E1A;&#x52A1;&#x5408;&#x4F5C;&#x548C;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x7684;&#x5E7F;&#x5EA6;&#x3001;&#x6DF1;&#x5EA6;&#x548C;&#x9891;&#x5EA6;&#x90FD;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x62D3;&#x5C55;&#xFF0C;&#x4F01;&#x4E1A;&#x7ADE;&#x4E89;&#x672C;&#x8EAB;&#x5DF2;&#x7ECF;&#x4ECE;&#x5355;&#x7EAF;&#x7684;&#x4E2A;&#x4F53;&#x95F4;&#x884C;&#x4E3A;&#x6F14;&#x53D8;&#x4E3A;&#x4EA7;&#x4E1A;&#x94FE;&#x5C42;&#x9762;&#x4E0A;&#x7684;&#x6FC0;&#x70C8;&#x7ADE;&#x4E89;&#xFF0C;&#x800C;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7684;&#x5EFA;&#x8BBE;&#x4E5F;&#x5448;&#x73B0;&#x51FA;&#x4ECE;&#x8FB9;&#x6CBF;&#x5411;&#x7EB5;&#x6DF1;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x3002;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x5728;ERP&#x6253;&#x7834;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x754C;&#x9650;&#xFF0C;&#x5F62;&#x6210;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x65E0;&#x8FB9;&#x754C;&#x4FE1;&#x606F;&#x6D41;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5168;&#x7A0B;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5C06;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x3001;&#x4F19;&#x4F34;&#x3001;&#x4F9B;&#x5E94;&#x5546;&#x548C;&#x5BA2;&#x6237;&#x7684;&#x4E92;&#x8054;&#x4E92;&#x901A;&#xFF0C;&#x6253;&#x7834;&#x4F01;&#x4E1A;&#x95F4;&#x7684;&#x754C;&#x9650;&#xFF0C;&#x5F62;&#x6210;&#x8DE8;&#x884C;&#x4E1A;/&#x7EC4;&#x7EC7;/&#x90E8;&#x95E8;&#x4E4B;&#x95F4;&#x65E0;&#x8FB9;&#x754C;&#x4FE1;&#x606F;&#x6D41;&#xFF0C;&#x590D;&#x6742;&#x4E1A;&#x52A1;&#x534F;&#x540C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x5C06;&#x539F;&#x672C;&#x96F6;&#x6563;&#x3001;&#x7247;&#x6BB5;&#x7684;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#xFF08;&#x4EBA;&#x5DE5;/&#x81EA;&#x52A8;&#xFF09;&#x548C;&#x4FE1;&#x606F;&#x4F18;&#x5316;&#x8FDB;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x591A;&#x4E2A;&#x4E1A;&#x52A1;&#x5B9E;&#x4F53;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x63D0;&#x4F9B;&#x7684;&#x5E7F;&#x6CDB;&#x8FDE;&#x901A;&#x6027;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x8FDB;&#x884C;&#x5F00;&#x653E;&#x3001;&#x7075;&#x6D3B;&#x3001;&#x53EF;&#x4FE1;&#x7684;&#x4FE1;&#x606F;&#x4EA4;&#x6362;&#x548C;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x95F4;&#x7684;&#x4E1A;&#x52A1;&#x534F;&#x540C;&#xFF0C;&#x53CA;&#x65F6;&#x54CD;&#x5E94;&#x53D8;&#x5316;&#x5E76;&#x6709;&#x6548;&#x7684;&#x652F;&#x6301;&#x4E1A;&#x52A1;&#x6218;&#x7565;&#x7684;&#x4EA4;&#x4ED8;&#xFF0C;&#x4ECE;&#x800C;&#x5FEB;&#x901F;&#x5F62;&#x6210;&#x65B0;&#x7684;&#x7ADE;&#x4E89;&#x529B;&#x4F18;&#x52BF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x652F;&#x6301;&#x57FA;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x5E7F;&#x6CDB;&#x8FDE;&#x901A;&#x6027;&#x7684;&#x590D;&#x6742;&#x4E1A;&#x52A1;&#x534F;&#x540C;&#x548C;&#x96C6;&#x6210;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5F62;&#x8C61;&#x5730;&#x8BF4;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x53E6;&#x4E00;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x662F;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x201C;&#x5BBD;&#x201D;&#x3002;</p>
<p><strong>2.&#x670D;&#x52A1;&#x5316;&#xFF1A;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x9762;&#x5411;&#x670D;&#x52A1;&#xFF0C;&#x6613;&#x4E8E;&#x96C6;&#x6210;</strong></p>
<p>&#x670D;&#x52A1;&#x5316;&#x4EE3;&#x8868;&#x4E86;&#x4E2D;&#x95F4;&#x4EF6;&#x5728;&#x63D0;&#x5347;IT&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E1A;&#x52A1;&#x654F;&#x6377;&#x6027;&#x65B9;&#x9762;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF0C;&#x5373;&#x652F;&#x6301;&#x5BF9;&#x57FA;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x3001;&#x8F6F;&#x4EF6;&#x548C;&#x670D;&#x52A1;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x6807;&#x51C6;&#x5316;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x80FD;&#x529B;&#x63D0;&#x4F9B;&#xFF0C;&#x6865;&#x63A5;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x5E73;&#x53F0;&#x4E4B;&#x95F4;&#x7684;&#x6280;&#x672F;&#x5F02;&#x6784;&#x6027;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E1A;&#x52A1;&#x6309;&#x9700;&#x7075;&#x6D3B;&#x7EC4;&#x7EC7;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8BA9;IT&#x4E0E;&#x4E1A;&#x52A1;&#x5BC6;&#x5207;&#x5339;&#x914D;&#xFF0C;&#x63D0;&#x5347;&#x7EC4;&#x7EC7;&#x7684;&#x4E1A;&#x52A1;&#x654F;&#x6377;&#x6027;&#x3002;</p>
<p>&#x4F01;&#x4E1A;&#x6700;&#x6839;&#x672C;&#x7684;&#x75DB;&#x70B9;&#x5728;&#x4E8E;&#x5176;&#x6613;&#x53D8;&#x7684;&#x4E1A;&#x52A1;&#x548C;&#x50F5;&#x5316;&#x7684;IT&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E4B;&#x95F4;&#x7684;&#x5C16;&#x9510;&#x77DB;&#x76FE;&#x3002;&#x4E1A;&#x52A1;&#x7684;&#x6613;&#x53D8;&#x6027;&#x662F;&#x4F01;&#x4E1A;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x4E1A;&#x52A1;&#x5DEE;&#x5F02;&#x5316;&#x800C;&#x8C0B;&#x6C42;&#x5229;&#x76CA;&#x6700;&#x5927;&#x5316;&#x7684;&#x5FC5;&#x7136;&#x7ED3;&#x679C;&#xFF0C;&#x662F;&#x6FC0;&#x70C8;&#x7684;&#x5E02;&#x573A;&#x7ADE;&#x4E89;&#x7684;&#x4EA7;&#x7269;&#x3002;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x4F01;&#x4E1A;&#x5E38;&#x5E38;&#x53D1;&#x73B0;&#xFF1A;&#x4E1A;&#x52A1;&#x9700;&#x8981;&#x6539;&#x53D8;&#xFF0C;&#x4F46;IT&#x5374;&#x4E0D;&#x80FD;&#x8FC5;&#x901F;&#x5730;&#x52A0;&#x4EE5;&#x54CD;&#x5E94;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x6839;&#x672C;&#x539F;&#x56E0;&#x5C31;&#x5728;&#x4E8E;&#x76EE;&#x524D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x4E0A;&#x5B58;&#x5728;&#x7740;&#x4E25;&#x91CD;&#x95EE;&#x9898;&#x672A;&#x80FD;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6280;&#x672F;&#x7684;&#x672C;&#x8D28;&#x662F;&#x590D;&#x7528;&#x3001;&#x677E;&#x8026;&#x5408;&#x3001;&#x4E92;&#x64CD;&#x4F5C;(&#x6807;&#x51C6;)&#x7B49;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x5185;&#x5728;&#x673A;&#x5236;&#x3002;&#x8F6F;&#x4EF6;&#x590D;&#x7528;&#xFF0C;&#x5373;&#x8F6F;&#x4EF6;&#x7684;&#x91CD;&#x7528;&#xFF0C;&#x4E5F;&#x53EB;&#x518D;&#x7528;&#xFF0C;&#x662F;&#x6307;&#x540C;&#x4E00;&#x4E8B;&#x7269;&#x4E0D;&#x4F5C;&#x4FEE;&#x6539;&#x6216;&#x7A0D;&#x52A0;&#x6539;&#x52A8;&#x5C31;&#x591A;&#x6B21;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x3002;&#x4ECE;&#x8F6F;&#x4EF6;&#x590D;&#x7528;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x6765;&#x770B;&#xFF0C;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x62BD;&#x8C61;&#x7EA7;&#x522B;&#xFF0C;&#x6269;&#x5927;&#x590D;&#x7528;&#x8303;&#x56F4;&#x3002;&#x6700;&#x65E9;&#x7684;&#x590D;&#x7528;&#x6280;&#x672F;&#x662F;&#x5B50;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x660E;&#x5B50;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x590D;&#x7528;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B50;&#x7A0B;&#x5E8F;&#x662F;&#x6700;&#x539F;&#x59CB;&#x7684;&#x590D;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x590D;&#x7528;&#x8303;&#x56F4;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x5185;&#x590D;&#x7528;&#xFF0C;&#x9759;&#x6001;&#x5F00;&#x53D1;&#x671F;&#x590D;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x7A0B;&#x5E8F;&#x4FEE;&#x6539;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x5B50;&#x7A0B;&#x5E8F;&#x7684;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x3001;&#x6D4B;&#x8BD5;&#x548C;&#x53D1;&#x5E03;&#x3002;</p>
<table>
<thead>
<tr>
<th style="text-align:left"><strong>&#x590D;&#x7528;&#x5BF9;&#x8C61;</strong></th>
<th style="text-align:left"><strong>&#x590D;&#x7528;&#x8303;&#x56F4;</strong></th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x5B50;&#x7A0B;&#x5E8F;</td>
<td style="text-align:left">&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x5185;&#x590D;&#x7528;&#xFF0C;&#x9759;&#x6001;&#x5F00;&#x53D1;&#x671F;&#x590D;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">&#x7EC4;&#x4EF6;(DLL,Com&#x7B49;)</td>
<td style="text-align:left">&#x7CFB;&#x7EDF;&#x5185;&#x590D;&#x7528;&#xFF0C;&#x52A8;&#x6001;&#x8FD0;&#x884C;&#x671F;&#x590D;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">&#x4F01;&#x4E1A;&#x5BF9;&#x8C61;&#x7EC4;&#x4EF6;&#xFF08;Com+,.NET,EJB&#x7B49;)</td>
<td style="text-align:left">&#x4F01;&#x4E1A;&#x7F51;&#x7EDC;&#x5185;&#x590D;&#x7528;&#xFF0C;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x590D;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">&#x670D;&#x52A1;(&#x5982;WebService,SCA/SDO)</td>
<td style="text-align:left">&#x4E0D;&#x540C;&#x4F01;&#x4E1A;&#x4E4B;&#x95F4;&#xFF0C;&#x5168;&#x7403;&#x590D;&#x7528;&#xFF0C;&#x52A8;&#x6001;&#x53EF;&#x914D;&#x7F6E;</td>
</tr>
</tbody>
</table>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53D1;&#x660E;&#x4E86;&#x7EC4;&#x4EF6;&#xFF08;&#x6216;&#x8005;&#x53EB;&#x63A7;&#x4EF6;&#xFF09;&#xFF0C;&#x5982;MS&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#x7684;DLL&#x7EC4;&#x4EF6;&#x3002;&#x7EC4;&#x4EF6;&#x5C06;&#x590D;&#x7528;&#x63D0;&#x5347;&#x4E86;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x56E0;&#x4E3A;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5185;&#x590D;&#x7528;&#xFF08;&#x540C;&#x4E00;&#x79CD;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x52A8;&#x6001;&#x3001;&#x8FD0;&#x884C;&#x671F;&#x590D;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x53D1;&#x5C55;&#xFF0C;&#x7EC4;&#x4EF6;&#x4E0E;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x964D;&#x4F4E;&#x3002;</p>
<p>&#x4E3A;&#x89E3;&#x51B3;&#x5206;&#x5E03;&#x5F0F;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x4E4B;&#x95F4;&#x7684;&#x7EC4;&#x4EF6;&#x590D;&#x7528;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x660E;&#x4E86;&#x4F01;&#x4E1A;&#x5BF9;&#x8C61;&#x7EC4;&#x4EF6;&#xFF0C;&#x5982;&#xFF08;Com+,.NET,EJB&#x7B49;)&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x5206;&#x5E03;&#x5F0F;&#x7EC4;&#x4EF6;&#x3002;&#x901A;&#x8FC7;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x4EE3;&#x7406;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x7F51;&#x7EDC;&#x5185;&#x590D;&#x7528;&#xFF0C;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x590D;&#x7528;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x7EC4;&#x4EF6;&#x5BF9;&#x8C61;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x4F46;&#x5206;&#x5E03;&#x5F0F;&#x7EC4;&#x4EF6;&#x4E5F;&#x662F;&#x4E25;&#x91CD;&#x4F9D;&#x8D56;&#x5176;&#x53D7;&#x63A7;&#x73AF;&#x5883;&#xFF0C;&#x7531;&#x4E8E;&#x6784;&#x4EF6;&#x5B9E;&#x73B0;&#x548C;&#x8FD0;&#x884C;&#x652F;&#x6491;&#x6280;&#x672F;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x8F83;&#x5927;&#x7684;&#x5F02;&#x6784;&#x6027;&#xFF0C;&#x4E0D;&#x540C;&#x6280;&#x672F;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x7684;&#x6784;&#x4EF6;&#x4E4B;&#x95F4;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x7EC4;&#x88C5;&#x5F0F;&#x590D;&#x7528;&#x3002;</p>
<p>&#x800C;&#x73B0;&#x4EE3;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x53D1;&#x5C55;&#x91CD;&#x8981;&#x8D8B;&#x52BF;&#x5C31;&#x662F;&#x4EE5;&#x670D;&#x52A1;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x5982;WebService,SCA/SDO&#x7B49;&#x3002;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x670D;&#x52A1;&#x7EC4;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x590D;&#x7528;&#x3001;&#x89E3;&#x8026;&#x548C;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;SOA&#x67B6;&#x6784;&#x4E2D;&#x95F4;&#x4EF6;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x662F;&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x5C01;&#x88C5;&#xFF0C;&#x670D;&#x52A1;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x7EC4;&#x88C5;&#x3001;&#x7F16;&#x6392;&#x548C;&#x91CD;&#x7EC4;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7684;&#x590D;&#x7528;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x590D;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x4F01;&#x4E1A;&#x4E4B;&#x95F4;&#xFF0C;&#x5168;&#x7403;&#x590D;&#x7528;&#xFF0C;&#x8FBE;&#x5230;&#x590D;&#x7528;&#x7684;&#x6700;&#x9AD8;&#x7EA7;&#x522B;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x52A8;&#x6001;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x590D;&#x7528;&#x3002;</p>
<p>SOA&#x67B6;&#x6784;&#x5728;&#x677E;&#x8026;&#x5408;&#xFF0C;&#x5C06;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x89E3;&#x8026;&#x8FC7;&#x7A0B;&#x4E5F;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x6700;&#x540E;&#x7684;&#x5883;&#x754C;&#x3002;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x5C06;&#x8F6F;&#x4EF6;&#x4E4B;&#x4E2D;&#x6838;&#x5FC3;&#x4E09;&#x90E8;&#x5206;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3001;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x3001;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5168;&#x90E8;&#x8026;&#x5408;&#x5728;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x4E4B;&#x4E2D;&#xFF0C;&#x5F62;&#x6210;&#x201C;&#x94C1;&#x677F;&#x4E00;&#x5757;&#x201D;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x201C;&#x7275;&#x4E00;&#x53D1;&#x800C;&#x52A8;&#x5168;&#x8EAB;&#x201D;&#xFF0C;&#x8F6F;&#x4EF6;&#x5C31;&#x96BE;&#x4EE5;&#x9002;&#x5E94;&#x53D8;&#x5316;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x6280;&#x672F;&#x5C06;&#x8FDE;&#x63A5;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#xFF0C;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x8FDE;&#x63A5;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x5F02;&#x6B65;&#x5904;&#x7406;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x548C;&#x4E00;&#x4E9B;&#x5206;&#x5E03;&#x5F0F;&#x5BF9;&#x8C61;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x4E5F;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x79BB;&#x3002;&#x800C;SOA&#x67B6;&#x6784;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E0E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3001;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x7B49;&#x8FDB;&#x884C;&#x5B8C;&#x5168;&#x7684;&#x89E3;&#x8026;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image002.jpg" alt=""></p>
<p>&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x65AD;&#x89E3;&#x8026;&#x7684;&#x8FC7;&#x7A0B;</p>
<p>&#x8F6F;&#x4EF6;&#x4E92;&#x64CD;&#x4F5C;&#x6280;&#x672F;&#x4E5F;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x5F00;&#x653E;&#x6027;&#x610F;&#x5473;&#x7740;&#x5404;&#x8282;&#x70B9;&#x53EF;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#xFF0C;&#x5BF9;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x8FDB;&#x884C;&#x4E86;&#x79C1;&#x6709;&#x5316;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x6784;&#x4EF6;&#x6A21;&#x578B;&#x548C;&#x67B6;&#x6784;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x6807;&#x51C6;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x81EA;&#x8EAB;&#x5728;&#x6784;&#x4EF6;&#x63CF;&#x8FF0;&#x3001;&#x53D1;&#x5E03;&#x3001;&#x53D1;&#x73B0;&#x3001;&#x8C03;&#x7528;&#x3001;&#x4E92;&#x64CD;&#x4F5C;&#x534F;&#x8BAE;&#x53CA;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7B49;&#x65B9;&#x9762;&#x5448;&#x73B0;&#x51FA;&#x5DE8;&#x5927;&#x7684;&#x5F02;&#x6784;&#x6027;&#x3002;&#x5404;&#x79CD;&#x4E0D;&#x826F;&#x6280;&#x672F;&#x7EA6;&#x675F;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x8DE8;&#x4E92;&#x8054;&#x7F51;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x91CD;&#x91CD;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x4E86;&#x8DE8;&#x4F01;&#x4E1A;/&#x90E8;&#x95E8;&#x7684;&#x4E1A;&#x52A1;&#x96C6;&#x6210;&#x548C;&#x91CD;&#x7EC4;&#x96BE;&#x4EE5;&#x7075;&#x6D3B;&#x5FEB;&#x901F;&#x7684;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x65B9;&#x9762;&#xFF0C;&#x4F20;&#x7EDF;&#x4E2D;&#x95F4;&#x4EF6;&#x53EA;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x8BBF;&#x95EE;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x5316;&#x7684;API&#x5B9E;&#x73B0;&#x4E86;&#x540C;&#x7C7B;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x8FDE;&#x63A5;&#x4E92;&#x64CD;&#x4F5C;&#x8FD8;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x8BBF;&#x95EE;&#x534F;&#x8BAE;&#xFF0C;&#x5982;JAVA&#x4F7F;&#x7528;RMI&#xFF0C;CORBA&#x4F7F;&#x7528;IIOP&#x7B49;&#x3002;&#x800C;SOA&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x7684;&#x3001;&#x652F;&#x6301;Internet&#x3001;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x65E0;&#x5173;&#x7684;SOAP&#x534F;&#x8BAE;&#x5B9E;&#x73B0;&#x4E86;&#x8FDE;&#x63A5;&#x4E92;&#x64CD;&#x4F5C;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x5C01;&#x88C5;&#x662F;&#x91C7;&#x7528;XML&#x534F;&#x8BAE;&#xFF0C;&#x5177;&#x6709;&#x81EA;&#x89E3;&#x6790;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x57FA;&#x4E8E;SOA&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8BED;&#x4E49;&#x4E92;&#x64CD;&#x4F5C;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image003.jpg" alt=""></p>
<p>&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E0B;&#x4E00;&#x4EE3;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x5728;&#x8F6F;&#x4EF6;&#x7684;&#x6A21;&#x578B;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x4E92;&#x64CD;&#x4F5C;&#x4EE5;&#x53CA;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x7B49;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF1A;</p>
<p>&#x6A21;&#x578B;&#xFF1A;&#x6784;&#x4EF6;&#x6A21;&#x578B;&#x5F39;&#x6027;&#x7C92;&#x5EA6;&#x5316;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x62BD;&#x8C61;&#x5C42;&#x5EA6;&#x66F4;&#x9AD8;&#x7684;&#x6784;&#x4EF6;&#x6A21;&#x578B;&#xFF0C;&#x5B9E;&#x73B0;&#x5177;&#x5907;&#x66F4;&#x9AD8;&#x7ED3;&#x6784;&#x72EC;&#x7ACB;&#x6027;&#x3001;&#x5185;&#x5BB9;&#x81EA;&#x5305;&#x542B;&#x6027;&#x548C;&#x4E1A;&#x52A1;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x53EF;&#x590D;&#x7528;&#x6784;&#x4EF6;&#xFF0C;&#x5373;&#x670D;&#x52A1;&#x3002;&#x5E76;&#x4E14;&#x5728;&#x7EC6;&#x7C92;&#x5EA6;&#x670D;&#x52A1;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x4E1A;&#x52A1;&#x5C42;&#x9762;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x5F62;&#x6210;&#x4E1A;&#x52A1;&#x7EC4;&#x4EF6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4ECE;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x5230;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x7684;&#x5168;&#x751F;&#x547D;&#x5468;&#x671F;&#x4F01;&#x4E1A;&#x5EFA;&#x6A21;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x7ED3;&#x6784;&#xFF1A;&#x7ED3;&#x6784;&#x677E;&#x6563;&#x5316;&#xFF0C;&#x5373;&#xFF0C;&#x5C06;&#x5B8C;&#x6574;&#x5206;&#x79BB;&#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x548C;&#x670D;&#x52A1;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x4EE5;&#x53CA;&#x670D;&#x52A1;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x548C;&#x63D0;&#x4F9B;&#x8005;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x6784;&#x5EFA;&#x548C;&#x96C6;&#x6210;&#x65F6;&#x5E38;&#x89C1;&#x7684;&#x6280;&#x672F;&#x3001;&#x7EC4;&#x7EC7;&#x3001;&#x65F6;&#x95F4;&#x7B49;&#x4E0D;&#x826F;&#x7EA6;&#x675F;&#x3002;</p>
<p>&#x4E92;&#x64CD;&#x4F5C;&#xFF1A;&#x4EA4;&#x4E92;&#x8FC7;&#x7A0B;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x5373;&#xFF0C;&#x5C06;&#x4E0E;&#x4E92;&#x64CD;&#x4F5C;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x6807;&#x51C6;&#x5316;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x3001;&#x63CF;&#x8FF0;&#x3001;&#x53D1;&#x5E03;&#x3001;&#x53D1;&#x73B0;&#x3001;&#x8C03;&#x7528;&#x7B49;&#x5951;&#x7EA6;&#xFF0C;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x683C;&#x5F0F;&#x7B49;&#x7B49;&#x3002;&#x6700;&#x7EC8;&#x5B9E;&#x73B0;&#x8BBF;&#x95EE;&#x4E92;&#x64CD;&#x4F5C;&#x3001;&#x8FDE;&#x63A5;&#x4E92;&#x64CD;&#x4F5C;&#x548C;&#x8BED;&#x4E49;&#x4E92;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5F00;&#x53D1;&#x96C6;&#x6210;&#x65B9;&#x6CD5;&#xFF1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x6784;&#x5EFA;&#x65B9;&#x5F0F;&#x7531;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x8F6C;&#x4E3A;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x95F4;&#x7684;&#x5FEB;&#x6377;&#x7EC4;&#x5408;&#x53CA;&#x7F16;&#x6392;&#xFF0C;&#x5B8C;&#x6210;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x6309;&#x9700;&#x63D0;&#x4F9B;&#x548C;&#x6539;&#x5584;&#xFF0C;&#x4ECE;&#x800C;&#x5927;&#x5927;&#x7B80;&#x5316;&#x548C;&#x52A0;&#x901F;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x642D;&#x5EFA;&#x53CA;&#x91CD;&#x6784;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x670D;&#x52A1;&#x5316;&#x4F53;&#x73B0;&#x7684;&#x662F;&#x4E2D;&#x95F4;&#x4EF6;&#x5728;&#x5B8C;&#x6574;&#x4E1A;&#x52A1;&#x590D;&#x7528;&#x3001;&#x7075;&#x6D3B;&#x4E1A;&#x52A1;&#x7EC4;&#x7EC7;&#x65B9;&#x9762;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x76EE;&#x6807;&#x662F;&#x63D0;&#x5347;IT&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x4E1A;&#x52A1;&#x654F;&#x6377;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x6210;&#x4E3A;SOA&#x7684;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x5E73;&#x53F0;&#x3002;</p>
<p><strong>3.&#x4E00;&#x4F53;&#x5316;&#xFF1A;&#x6613;&#x4E8E;&#x5E73;&#x53F0;&#x6F14;&#x5316;&#x3001;&#x6613;&#x4E8E;&#x5F00;&#x53D1;&#x3001;&#x6613;&#x4E8E;&#x7BA1;&#x7406;</strong></p>
<p>&#x4E00;&#x4F53;&#x5316;&#x4EE3;&#x8868;&#x4E86;&#x79CD;&#x7C7B;&#x7E41;&#x591A;&#x3001;&#x529F;&#x80FD;&#x76F8;&#x5BF9;&#x5355;&#x4E00;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x8D8B;&#x5411;&#x96C6;&#x6210;&#x548C;&#x6574;&#x5408;&#xFF0C;&#x5F62;&#x6210;&#x7EDF;&#x4E00;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x4EE5;&#x5404;&#x81EA;&#x95EE;&#x9898;&#x57DF;&#x4E3A;&#x6838;&#x5FC3;&#x5F62;&#x6210;&#x4E86;&#x591A;&#x79CD;&#x4E13;&#x95E8;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#xFF0C;&#x5982;&#x4E8B;&#x52A1;&#xFF08;&#x4EA4;&#x6613;&#xFF09;&#x4E2D;&#x95F4;&#x4EF6;&#x3001;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x3001;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x3001;&#x96C6;&#x6210;&#x4E2D;&#x95F4;&#x4EF6;&#x7B49;&#x3002;&#x4F34;&#x968F;&#x7740;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E0D;&#x540C;&#x79CD;&#x7C7B;&#x548C;&#x5382;&#x5546;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x5728;Internet&#x4E4B;&#x4E0A;&#xFF0C;&#x5171;&#x540C;&#x7EC4;&#x6210;&#x4E86;&#x5927;&#x89C4;&#x6A21;&#x5173;&#x952E;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;&#x8FD9;&#x4E9B;&#x6838;&#x5FC3;&#x5173;&#x952E;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#xFF0C;&#x6D89;&#x53CA;&#x7684;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x5E7F;&#x6CDB;&#xFF0C;&#x529F;&#x80FD;&#x5355;&#x4E00;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x5DF2;&#x4E0D;&#x8DB3;&#x4EE5;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x5168;&#x90E8;&#x9700;&#x6C42;&#x3002;&#x5BA2;&#x6237;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x5F00;&#x653E;&#x7684;&#x96C6;&#x6210;&#x5316;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x9002;&#x5E94;&#x4E92;&#x8054;&#x7F51;&#x8BA1;&#x7B97;&#x73AF;&#x5883;&#x7684;&#x5F00;&#x653E;&#x3001;&#x52A8;&#x6001;&#x3001;&#x591A;&#x53D8;&#x7684;&#x7279;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x79CD;&#x7C7B;&#x7E41;&#x591A;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x9700;&#x8981;&#x8D70;&#x5411;&#x6574;&#x5408;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4F53;&#x5316;&#x7684;&#x8D8B;&#x52BF;&#x4E2D;&#xFF0C;&#x672A;&#x6765;&#x96C6;&#x6210;&#x5316;&#x7684;&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x6240;&#x5305;&#x542B;&#x7684;&#x5404;&#x7C7B;&#x4E2D;&#x95F4;&#x4EF6;&#x5B50;&#x4EA7;&#x54C1;&#x5171;&#x540C;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x7684;&#x6709;&#x673A;&#x6574;&#x4F53;&#xFF0C;&#x8FD9;&#x79CD;&#x201C;&#x96C6;&#x6210;&#x5316;&#x201D;&#xFF0C;&#x7EDD;&#x975E;&#x7B80;&#x5355;&#x62FC;&#x51D1;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x6DF1;&#x5EA6;&#x6574;&#x5408;&#xFF0C;&#x5177;&#x4F53;&#x4F53;&#x73B0;&#x5728;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<p><strong>3.1.&#x7EDF;&#x4E00;&#x5185;&#x6838;&#x7684;&#x4EA7;&#x54C1;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x6613;&#x4E8E;&#x6F14;&#x5316;</strong></p>
<p>&#x96C6;&#x6210;&#x5316;&#x7684;&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x826F;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x7684;&#x5E94;&#x7528;&#x73AF;&#x5883;&#x3002;&#x800C;&#x4F7F;&#x7528;&#x5FAE;&#x5185;&#x6838;&#x8BBE;&#x8BA1;&#x662F;&#x6784;&#x5EFA;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x53EF;&#x7075;&#x6D3B;&#x63D2;&#x62D4;&#x7684;&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x7684;&#x91CD;&#x8981;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x96C6;&#x6210;&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x9700;&#x8981;&#x6574;&#x5408;&#x591A;&#x79CD;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x5185;&#x90E8;&#x529F;&#x80FD;&#x5FC5;&#x7136;&#x5E9E;&#x5927;&#x800C;&#x590D;&#x6742;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x590D;&#x6742;&#x6027;&#x548C;&#x63D0;&#x9AD8;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x7684;&#x5FAE;&#x5185;&#x6838;&#x5316;&#x5C06;&#x662F;&#x5FC5;&#x7136;&#x8D8B;&#x52BF;&#xFF0C;&#x5FAE;&#x5185;&#x6838;&#x8D1F;&#x8D23;&#x534F;&#x8C03;&#x591A;&#x4E2A;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x901A;&#x8FC7;&#x5FAE;&#x5185;&#x6838;&#x4F53;&#x7CFB;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5E73;&#x53F0;&#x5185;&#x90E8;&#x63A5;&#x53E3;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5B9E;&#x73B0;&#x66F4;&#x52A0;&#x5065;&#x58EE;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#x9AD8;&#x6548;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x8868;&#x73B0;&#x3002;&#x4F7F;&#x7528;&#x7075;&#x6D3B;&#x7684;&#x5FAE;&#x5185;&#x6838;&#x8BBE;&#x8BA1;&#xFF0C;&#x65B0;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x52A0;&#x5165;&#x4EE5;&#x53CA;&#x65E7;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x7684;&#x5E9F;&#x5F03;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5BF9;&#x6574;&#x4E2A;&#x5E73;&#x53F0;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x6839;&#x672C;&#x6027;&#x7684;&#x53D8;&#x52A8;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image004.jpg" alt=""></p>
<p>&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x5FAE;&#x5185;&#x6838;</p>
<p>&#x5FAE;&#x5185;&#x6838;&#x5C06;&#x63D0;&#x4F9B;&#x4E2D;&#x95F4;&#x4EF6;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x7EBF;&#x7A0B;&#x670D;&#x52A1;&#x3001;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#x3001;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x548C;&#x4E8B;&#x52A1;&#x670D;&#x52A1;&#xFF0C;&#x5FAE;&#x5185;&#x6838;&#x7684;&#x53EF;&#x52A8;&#x6001;&#x7EC4;&#x4EF6;&#x5316;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x7ED3;&#x6784;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x6574;&#x5408;&#x548C;&#x53D1;&#x5C55;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x8DEF;&#x7EBF;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x8BB8;&#x591A;&#x4F20;&#x7EDF;&#x7684;&#x4F20;&#x7EDF;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x8FD8;&#x662F;&#x57FA;&#x4E8E;C&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x548C;Java&#x8BED;&#x8A00;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x5728;&#x6574;&#x5408;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x90E8;&#x5206;&#x5382;&#x5546;&#xFF08;&#x5982;BEA/Oracle&#x548C;&#x91D1;&#x8776;APUSIC&#xFF09;&#x5728;JAVA&#x5E73;&#x53F0;&#x4E0A;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x7EDF;&#x4E00;&#x5FAE;&#x5185;&#x6838;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x7ED3;&#x6784;&#x4F53;&#x7CFB;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x672A;&#x6765;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x5F62;&#x6001;&#x4E0A;&#x7684;&#x91CD;&#x8981;&#x8D8B;&#x52BF;&#x3002;</p>
<p><strong>3.2.&#x7EDF;&#x4E00;&#x7684;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#xFF0C;&#x6613;&#x4E8E;&#x7BA1;&#x7406;</strong></p>
<p>&#x9996;&#x5148;&#xFF0C;&#x96C6;&#x6210;&#x5316;&#x7684;&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x5E73;&#x53F0;&#x7684;&#x7BA1;&#x7406;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x5168;&#x5C40;&#x7684;&#x3001;&#x7CFB;&#x7EDF;&#x5316;&#x7684;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x4E2D;&#x95F4;&#x4EF6;&#x4EE5;&#x53CA;&#x540C;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;&#x5E73;&#x53F0;&#x7684;&#x7BA1;&#x7406;&#x5177;&#x6709;&#x5178;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#x5316;&#x7279;&#x6027;&#xFF0C;&#x90A3;&#x4E9B;&#x4EC5;&#x9488;&#x5BF9;&#x5355;&#x4E2A;&#x4E2D;&#x95F4;&#x4EF6;&#x5B9E;&#x4F8B;&#x6216;&#x7C7B;&#x578B;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x5176;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x4E0D;&#x660E;&#x663E;&#x751A;&#x81F3;&#x4EA7;&#x751F;&#x4E25;&#x91CD;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;&#x800C;&#x53EA;&#x6709;&#x5168;&#x5C40;&#x8003;&#x5BDF;&#x7CFB;&#x7EDF;&#xFF0C;&#x7EDF;&#x7B79;&#x5206;&#x6790;&#x548C;&#x89C4;&#x5212;&#xFF0C;&#x624D;&#x80FD;&#x5236;&#x5B9A;&#x51FA;&#x5408;&#x7406;&#x6709;&#x6548;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x6848;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5E73;&#x53F0;&#x7684;&#x7BA1;&#x7406;&#x8FD8;&#x5FC5;&#x987B;&#x517C;&#x987E;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7684;&#x5F00;&#x653E;&#x3001;&#x5F02;&#x6784;&#x3001;&#x52A8;&#x6001;&#x7B49;&#x7279;&#x6027;&#x3002;&#x5F00;&#x653E;&#x6027;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x5BFC;&#x81F4;&#x5404;&#x79CD;&#x5404;&#x6837;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x8FD0;&#x884C;&#x5728;&#x5F00;&#x653E;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4E4B;&#x4E0A;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x6709;&#x6548;&#x624B;&#x6BB5;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x88AB;&#x6709;&#x6548;&#x5730;&#x7BA1;&#x7406;&#x8D77;&#x6765;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x673A;&#x6574;&#x4F53;&#x3002;&#x5F02;&#x6784;&#x6027;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x80FD;&#x6307;&#x671B;&#x5E73;&#x53F0;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x90FD;&#x662F;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4EA7;&#x54C1;&#x5B9E;&#x4F8B;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x5E73;&#x6ED1;&#x5730;&#x6865;&#x63A5;&#x5F02;&#x6784;&#x6027;&#xFF0C;&#x964D;&#x4F4E;&#x5F02;&#x6784;&#x6027;&#x63A7;&#x5236;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x96BE;&#x5EA6;&#x3002;&#x52A8;&#x6001;&#x6027;&#x610F;&#x5473;&#x7740;&#x5E73;&#x53F0;&#x4E2D;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x88AB;&#x4EBA;&#x4E3A;&#x5730;&#x589E;&#x5220;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x7531;&#x4E8E;&#x610F;&#x5916;&#x539F;&#x56E0;&#x800C;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x5FC5;&#x987B;&#x8DB3;&#x591F;&#x7075;&#x6D3B;&#x4EE5;&#x5E94;&#x5BF9;&#x88AB;&#x7BA1;&#x7406;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x53CA;&#x5176;&#x5B9E;&#x4F8B;&#x7684;&#x5FEB;&#x901F;&#x3001;&#x6301;&#x7EED;&#x7684;&#x53D8;&#x5316;&#x6027;&#x3002;</p>
<p>&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x4E00;&#x4F53;&#x5316;&#x7BA1;&#x7406;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x7BA1;&#x7406;&#x6A21;&#x578B;&#x670D;&#x52A1;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x6765;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#x3001;&#x884C;&#x4E3A;&#x548C;&#x53CD;&#x9988;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7684;&#x7F16;&#x6392;&#x6765;&#x5B9E;&#x73B0;&#x7BA1;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#x53EF;&#x52A8;&#x6001;&#x8FDB;&#x884C;&#x81EA;&#x9002;&#x5E94;&#x3002;</p>
<p>&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#xFF0C;&#x4E5F;&#x5C06;&#x5728;&#x96C6;&#x6210;&#x4E00;&#x4F53;&#x5316;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x7684;&#x8C03;&#x5EA6;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x865A;&#x62DF;&#x5316;&#x540E;&#xFF0C;&#x5B9E;&#x73B0;&#x53EF;&#x81EA;&#x9002;&#x5E94;&#x548C;&#x81EA;&#x611F;&#x77E5;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x81EA;&#x6211;&#x4F18;&#x5316;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image005.jpg" alt=""></p>
<p>&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x7BA1;&#x7406;&#x6A21;&#x578B;</p>
<p><strong>3.3.&#x7EDF;&#x4E00;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x6613;&#x4E8E;&#x5F00;&#x53D1;</strong></p>
<p>&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x4E0D;&#x540C;&#x79CD;&#x7C7B;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x6240;&#x63D0;&#x4F9B;&#x6784;&#x4EF6;&#x6A21;&#x578B;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x90E8;&#x7F72;&#x673A;&#x5236;&#x4E5F;&#x5404;&#x6709;&#x5DEE;&#x5F02;&#x3002;&#x8FD9;&#x79CD;&#x6784;&#x4EF6;&#x6A21;&#x578B;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x5C06;&#x4F1A;&#x589E;&#x52A0;&#x5F00;&#x53D1;&#x96BE;&#x5EA6;&#xFF0C;&#x63D0;&#x9AD8;&#x5B66;&#x4E60;&#x4E0E;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x5E26;&#x6765;&#x5DE8;&#x5927;&#x7684;&#x56F0;&#x6270;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x7EDF;&#x4E00;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x6765;&#x5B8C;&#x6210;&#x7528;&#x6237;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x7EDF;&#x4E00;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x80FD;&#x591F;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x4E2D;&#x95F4;&#x4EF6;&#x79CD;&#x7C7B;&#xFF0C;&#x53D1;&#x5E03;&#x6210;&#x7B26;&#x5408;&#x8BE5;&#x4E2D;&#x95F4;&#x4EF6;&#x8981;&#x6C42;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x5177;&#x5907;&#x4E00;&#x81F4;&#x7684;&#x90E8;&#x7F72;&#x673A;&#x5236;&#xFF1B;&#x5E76;&#x4E14;&#xFF0C;&#x8FD9;&#x79CD;&#x53D1;&#x5E03;&#x4E0E;&#x8F6C;&#x6362;&#x5BF9;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x5E94;&#x8BE5;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x8FD9;&#x5C06;&#x7ED9;&#x7528;&#x6237;&#x5E26;&#x6765;&#x5DE8;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image006.jpg" alt=""></p>
<p>&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x4EF6;&#x7F16;&#x7A0B;&#x6A21;&#x578B;</p>
<p>&#x76EE;&#x524D;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x4E00;&#x822C;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x5F53;&#x4ECA;&#x5927;&#x89C4;&#x6A21;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x5927;&#x90FD;&#x9700;&#x8981;&#x591A;&#x79CD;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x7684;&#x5171;&#x540C;&#x652F;&#x6491;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x5BFC;&#x81F4;&#x4E86;&#x7528;&#x6237;&#x5F00;&#x53D1;&#x3001;&#x7BA1;&#x7406;&#x3001;&#x76D1;&#x63A7;&#x7684;&#x96BE;&#x5EA6;&#x5927;&#x5927;&#x52A0;&#x6DF1;&#x3002;&#x4E2D;&#x95F4;&#x4EF6;&#x5728;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7EDF;&#x4E00;&#x8FD0;&#x884C;&#x652F;&#x6491;&#x5E73;&#x53F0;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7EDF;&#x4E00;&#x7684;&#x96C6;&#x6210;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3002;&#x8FD9;&#x79CD;&#x96C6;&#x6210;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x663E;&#x7136;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;&#x5404;&#x7C7B;&#x4E2D;&#x95F4;&#x4EF6;&#x5F00;&#x53D1;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x7684;&#x7B80;&#x5355;&#x62FC;&#x51D1;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x662F;&#x6982;&#x5FF5;&#x7EDF;&#x4E00;&#xFF0C;&#x529F;&#x80FD;&#x4E92;&#x901A;&#x7684;&#x6709;&#x673A;&#x6574;&#x4F53;&#x3002;&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#xFF0C;&#x9762;&#x5411;SOA&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x63D0;&#x4F9B;&#x4E86;&#x91C7;&#x7528;&#x670D;&#x52A1;&#x6A21;&#x578B;&#x6765;&#x5B9E;&#x73B0;&#x7EDF;&#x4E00;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x7684;&#x53EF;&#x884C;&#x6027;&#x3002;</p>
<p><strong>3.4.&#x7EDF;&#x4E00;&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x534F;&#x8BAE;</strong></p>
<p>&#x73B0;&#x4ECA;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x5448;&#x73B0;&#x51FA;&#x4E92;&#x8054;&#x7F51;&#x5316;&#x3002;Internet&#x6B63;&#x5728;&#x5B8C;&#x6210;&#x4ECE;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x53D1;&#x5E03;&#x4E0E;&#x8BBF;&#x95EE;&#x5E73;&#x53F0;&#x5230;&#x5E94;&#x7528;&#x8BA1;&#x7B97;&#x57FA;&#x7840;&#x652F;&#x6491;&#x5E73;&#x53F0;&#x7684;&#x8F6C;&#x53D8;&#x3002;&#x4F20;&#x7EDF;&#x4E2D;&#x95F4;&#x4EF6;&#x57FA;&#x4E8E;Intranet&#x6216;&#x79C1;&#x6709;&#x534F;&#x8BAE;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x9002;&#x5E94;Internet&#x5F00;&#x653E;&#x3001;&#x52A8;&#x6001;&#x3001;&#x6613;&#x53D8;&#x7684;&#x73AF;&#x5883;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD0;&#x884C;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x73AF;&#x5883;&#x4E0A;&#x7684;&#x5404;&#x79CD;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x5E94;&#x63D0;&#x4F9B;&#x57FA;&#x4E8E;http&#x534F;&#x8BAE;&#x7684;&#xFF0C;&#x5B89;&#x5168;&#x53EF;&#x4FE1;&#x7684;&#xFF0C;&#x5177;&#x6709;&#x81EA;&#x9002;&#x5E94;&#x80FD;&#x529B;&#x7684;&#x7EDF;&#x4E00;&#x4E92;&#x64CD;&#x4F5C;&#x534F;&#x8BAE;&#x3002;&#x800C;&#x4E2D;&#x95F4;&#x4EF6;&#x4EA7;&#x54C1;&#x672C;&#x8EAB;&#x7684;&#x7BA1;&#x7406;&#x3001;&#x76D1;&#x63A7;&#x7B49;&#x4E92;&#x64CD;&#x4F5C;API&#xFF0C;&#x4EE5;&#x53CA;&#x90E8;&#x7F72;&#x5728;&#x5176;&#x4E0A;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x63A5;&#x53E3;&#xFF0C;&#x5219;&#x4EE5;&#x6807;&#x51C6;&#x670D;&#x52A1;&#x5F62;&#x5F0F;&#x57FA;&#x4E8E;&#x8FD9;&#x79CD;&#x7EDF;&#x4E00;&#x4E92;&#x64CD;&#x4F5C;&#x534F;&#x8BAE;&#x53D1;&#x5E03;&#xFF0C;&#x4F7F;&#x591A;&#x4E2A;&#x8FD0;&#x7B97;&#x8282;&#x70B9;&#x5F97;&#x4EE5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x5F62;&#x6210;&#x6709;&#x673A;&#x6574;&#x4F53;&#xFF0C;&#x5B9E;&#x73B0;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x4E92;&#x8054;&#x4E92;&#x901A;&#xFF0C;&#x968F;&#x9700;&#x5E94;&#x53D8;&#x3002;</p>
<p>&#x7B80;&#x8A00;&#x4E4B;&#xFF0C;&#x4E00;&#x4F53;&#x5316;&#x4EE3;&#x8868;&#x4E86;&#x4E2D;&#x95F4;&#x4EF6;&#x4ECE;&#x5355;&#x4E00;&#x529F;&#x80FD;&#x6027;&#x4EA7;&#x54C1;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x7EDF;&#x4E00;&#x5E73;&#x53F0;&#x7684;&#x91CD;&#x8981;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x3002;</p>
<p><strong>4.&#x865A;&#x62DF;&#x5316;&#xFF1A;&#x652F;&#x6301;&#x4E91;&#x8BA1;&#x7B97;&#xFF0C;&#x6613;&#x4E8E;&#x5E94;&#x7528;&#x4EA4;&#x4ED8;</strong></p>
<p>&#x865A;&#x62DF;&#x5316;&#x662F;&#x5B9E;&#x73B0;&#x8D44;&#x6E90;&#x6574;&#x5408;&#x7684;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x3002;&#x65E9;&#x671F;&#x5C0F;&#x578B;&#x673A;&#x548C;&#x5927;&#x578B;&#x673A;&#x901A;&#x8FC7;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x533A;&#x6280;&#x672F;&#xFF08;Partition&#xFF09;&#x5B9E;&#x73B0;&#x4E86;&#x8D44;&#x6E90;&#x7684;&#x6709;&#x6548;&#x5229;&#x7528;&#xFF0C;&#x4F18;&#x5316;&#x8C03;&#x5EA6;&#x548C;&#x5206;&#x914D;&#x3002;&#x901A;&#x8FC7;&#x96C6;&#x7FA4;&#x6280;&#x672F;&#xFF08;Cluster&#xFF09;&#x5B9E;&#x73B0;&#x4E86;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x865A;&#x62DF;&#x4E3A;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x8D1F;&#x8F7D;&#x7684;&#x5747;&#x8861;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x89E3;&#x51B3;&#x6027;&#x80FD;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E91;&#x8BA1;&#x7B97;&#x4EE3;&#x8868;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x4EF7;&#x503C;&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E34;&#x754C;&#x70B9;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7684;&#x6548;&#x7387;&#x3001;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x5E94;&#x7528;&#x4EA4;&#x4ED8;&#x6A21;&#x5F0F;&#x3002;&#x4E91;&#x8BA1;&#x7B97;&#x4E0D;&#x4EC5;&#x5B9E;&#x73B0;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x7684;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x8FD8;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7684;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x4EE5;&#x53CA;&#x8F6F;&#x4EF6;&#x4EA4;&#x4ED8;&#x6A21;&#x5F0F;&#x7684;&#x865A;&#x62DF;&#x5316;&#x3002;</p>
<p>&#x4F34;&#x968F;&#x4E92;&#x8054;&#x7F51;&#x53CA;&#x73B0;&#x4EE3;&#x670D;&#x52A1;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#xFF0C;IT&#x57FA;&#x7840;&#x80FD;&#x529B;&#x4EE5;&#x670D;&#x52A1;&#x7684;&#x5F62;&#x5F0F;&#x63D0;&#x4F9B;&#x5DF2;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;SaaS&#x3001;PaaS&#x3001;MaaS&#x7B49;&#x65B0;&#x4E1A;&#x52A1;&#x6A21;&#x5F0F;&#x4E0D;&#x65AD;&#x6D8C;&#x73B0;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x652F;&#x6491;&#x8FD9;&#x4E9B;XaaS&#x4E1A;&#x52A1;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#x6700;&#x7EC8;&#x5747;&#x79BB;&#x4E0D;&#x5F00;&#x4E91;&#x8BA1;&#x7B97;&#x3002;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x52A8;&#x6001;&#x5206;&#x914D;&#x7684;&#x65B0;&#x6280;&#x672F;&#x5E73;&#x53F0;&#xFF0C;&#x5C06;&#x6784;&#x6210;&#x672A;&#x6765;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5927;&#x89C4;&#x6A21;&#x5E94;&#x7528;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x662F;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x7684;&#x91CD;&#x8981;&#x8D8B;&#x52BF;&#x3002;</p>
<p>&#x4E91;&#x8BA1;&#x7B97;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x8F6F;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x7684;&#x865A;&#x62DF;&#x5316;&#x7BA1;&#x7406;&#xFF0C;&#x652F;&#x6301;&#x5E94;&#x7528;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x548C;&#x7BA1;&#x7406;&#xFF0C;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x95F4;&#x7684;&#x5B9E;&#x4F8B;&#x7EA7;&#x9694;&#x79BB;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x5927;&#x89C4;&#x6A21;&#x5E94;&#x7528;&#x96C6;&#x7FA4;&#x53CA;&#x5927;&#x89C4;&#x6A21;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x3002;&#x865A;&#x62DF;&#x5316;&#x662F;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x4E91;&#x67B6;&#x6784;&#x7684;&#x4E00;&#x79CD;&#x57FA;&#x7840;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x3002;&#x5728;&#x4E91;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x6307;&#x5E73;&#x53F0;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4ECE;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x7684;&#x4EBA;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x7269;&#x7406;IT&#x8D44;&#x6E90;&#x7684;&#x62BD;&#x8C61;&#x4F5C;&#x7528;&#x3002;&#x865A;&#x62DF;&#x5316;&#x5141;&#x8BB8;&#x5C06;&#x670D;&#x52A1;&#x5668;&#x3001;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x548C;&#x5176;&#x4ED6;&#x786C;&#x4EF6;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x6C60;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x79BB;&#x6563;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x6765;&#x5206;&#x914D;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5176;&#x5E94;&#x7528;&#x7684;&#x76EE;&#x6807;&#x5C06;&#x662F;&#x6709;&#x6548;&#x7684;&#x7EDF;&#x4E00;&#x540E;&#x7AEF;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8F6F;/&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5728;&#x65B0;&#x4E00;&#x4EE3;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x7684;&#x7406;&#x5FF5;&#x4E2D;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x548C;&#x670D;&#x52A1;&#x5316;&#x76F8;&#x7ED3;&#x5408;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x3002;&#x4E8C;&#x8005;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x76F8;&#x4E92;&#x4FC3;&#x8FDB;&#xFF0C;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x80FD;&#x591F;&#x5728;&#x7EC4;&#x7EC7;&#x7684;IT&#x67B6;&#x6784;&#x548C;&#x4E1A;&#x52A1;&#x8F6C;&#x578B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x6325;&#x6700;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x670D;&#x52A1;&#x5316;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x4E1A;&#x52A1;&#x9A71;&#x52A8;&#x7684;IT&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x7EFC;&#x5408;&#x5E94;&#x7528;&#xFF0C;&#x6CE8;&#x91CD;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF1B;&#x865A;&#x62DF;&#x5316;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x90E8;&#x7F72;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x6CE8;&#x91CD;&#x80FD;&#x529B;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x4FBF;&#x6027;&#x548C;&#x5408;&#x7406;&#x6027;&#x3002;&#x865A;&#x62DF;&#x5316;&#x6709;&#x52A9;&#x4E8E;&#x66F4;&#x5FEB;&#x5730;&#x663E;&#x793A;&#x90E8;&#x7F72;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x6295;&#x8D44;&#x56DE;&#x62A5;&#x7387;&#xFF08;ROI&#xFF09;&#x3002;&#x4ECE;&#x670D;&#x52A1;&#x5316;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x662F;&#x4E00;&#x79CD;&#x628A;IT&#x8D44;&#x6E90;&#x5F53;&#x4F5C;&#x670D;&#x52A1;&#x6765;&#x63D0;&#x4F9B;&#x7684;&#x624B;&#x6BB5;&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;IT&#x8D44;&#x6E90;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x865A;&#x62DF;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x6765;&#x63D0;&#x4F9B;&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3001;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3001;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x3001;&#x8054;&#x7F51;&#x3001;&#x7F16;&#x7A0B;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#x548C;&#x534F;&#x4F5C;&#x5DE5;&#x5177;&#x3002;&#x865A;&#x62DF;&#x5316;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x80FD;&#x591F;&#x66F4;&#x6709;&#x6548;&#x7684;&#x652F;&#x6301;&#x5927;&#x91CF;&#x7684;&#x73B0;&#x6709;&#x670D;&#x52A1;&#x548C;&#x8D44;&#x4EA7;&#xFF0C;&#x4ECE;&#x800C;&#x4FC3;&#x4F7F;&#x7EC4;&#x7EC7;&#x66F4;&#x4E3A;&#x6DF1;&#x523B;&#x548C;&#x5E7F;&#x6CDB;&#x7684;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x5316;&#x8F6C;&#x578B;&#x548C;&#x6539;&#x9020;&#x3002;&#x5373;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x73AF;&#x5883;&#x7684;&#x4F7F;&#x7528;&#x7387;&#xFF0C;&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x7684;&#x603B;&#x6210;&#x672C;&#xFF0C;&#x7EE7;&#x800C;&#x901A;&#x8FC7;&#x5173;&#x8054;&#x6548;&#x5E94;&#xFF0C;&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x5316;&#x5EFA;&#x8BBE;&#x7684;&#x603B;&#x6210;&#x672C;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7684;&#x6548;&#x7387;&#x3001;&#x5DE8;&#x5927;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x66F4;&#x5FEB;&#x3001;&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x81EA;&#x8EAB;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x7684;&#x5177;&#x4F53;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x52A8;&#x6001;&#x5206;&#x914D;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;&#x7EC4;&#x7EC7;&#x7684;&#x8F6F;/&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#xFF0C;&#x4F18;&#x5316;&#x7EC4;&#x7EC7;&#x7684;&#x8D44;&#x6E90;&#x6A21;&#x578B;&#xFF0C;&#x5B9E;&#x73B0;&#x7075;&#x6D3B;&#x654F;&#x6377;&#x7684;&#x8D44;&#x6E90;&#x90E8;&#x7F72;&#xFF0C;&#x4FC3;&#x8FDB;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x6574;&#x5408;&#xFF0C;&#x63D0;&#x9AD8;&#x5176;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x8282;&#x7EA6;&#x7A7A;&#x95F4;&#x548C;&#x80FD;&#x6E90;&#xFF0C;&#x5E76;&#x4E3A;&#x707E;&#x96BE;&#x6062;&#x590D;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x63D0;&#x4F9B;&#x65B0;&#x7684;&#x9009;&#x9879;&#x3002;</p>
<p><img src="file:///C:/Users/1/AppData/Local/Temp/msohtmlclip1/01/clip_image007.jpg" alt=""></p>
<p>&#x7B80;&#x8A00;&#x4E4B;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x7740;&#x773C;&#x4E8E;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x8FD0;&#x884C;&#x65F6;&#x90E8;&#x7F72;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x5176;&#x6709;&#x6548;&#x5229;&#x7528;&#x548C;&#x6210;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x6CE8;&#x91CD;&#x8D44;&#x6E90;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x4FBF;&#x6027;&#x548C;&#x5408;&#x7406;&#x6027;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x4ECA;&#x540E;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4E2D;&#x95F4;&#x4EF6;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x7684;&#x91CD;&#x8981;&#x8D8B;&#x52BF;&#x3002;</p>
<p><strong>5.&#x540E;&#x7AEF;&#x5E73;&#x53F0;&#x6DF1;&#x5EA6;&#x878D;&#x5408;</strong></p>
<p>&#x672A;&#x6765;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x662F;Internet&#x65F6;&#x4EE3;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x7684;&#x6838;&#x5FC3;&#x57FA;&#x7840;&#x5E73;&#x53F0;&#xFF0C;&#x5B83;&#x8D34;&#x8FD1;&#x5E76;&#x76F4;&#x63A5;&#x670D;&#x52A1;&#x4E8E;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x63D0;&#x4F9B;&#x5B8C;&#x6574;&#x800C;&#x5F3A;&#x5927;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x652F;&#x6491;&#x80FD;&#x529B;&#xFF0C;&#x5C4F;&#x853D;&#x4E86;&#x6781;&#x7AEF;&#x5F00;&#x653E;&#x3001;&#x52A8;&#x6001;&#x3001;&#x591A;&#x53D8;&#x4E92;&#x8054;&#x7F51;&#x73AF;&#x5883;&#x4E2D;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x591A;&#x6837;&#x6027;&#x548C;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x51DD;&#x7EC3;&#x66F4;&#x591A;&#x4E1A;&#x52A1;/&#x5E94;&#x7528;&#x6A21;&#x5F0F;&#x7684;&#x5171;&#x6027;&#xFF0C;&#x6865;&#x63A5;&#x8DE8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5DE8;&#x5927;&#x6280;&#x672F;&#x5F02;&#x6784;&#x6027;&#xFF0C;&#x771F;&#x6B63;&#x5EFA;&#x7ACB;&#x8D77;&#x57FA;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7A7A;&#x524D;&#x5E7F;&#x6CDB;&#x7684;&#x8FDE;&#x901A;&#x6027;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x63D0;&#x4F9B;&#x65B9;&#x5F0F;&#x7684;&#x52A8;&#x6001;&#x5316;&#x3001;&#x6807;&#x51C6;&#x5316;&#x3001;&#x5F39;&#x6027;&#x5316;&#x548C;&#x6700;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5927;&#x80C6;&#x7684;&#x8BBE;&#x60F3;&#x662F;&#x672A;&#x6765;&#x4E94;&#x5E74;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x7EDF;&#x4E00;&#x524D;&#x7AEF;&#xFF0C;&#x800C;&#x540E;&#x7AEF;&#x5E73;&#x53F0;&#xFF08;&#x4E2D;&#x95F4;&#x4EF6;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x8D70;&#x5411;&#x6DF1;&#x5EA6;&#x878D;&#x5408;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x7684;IT&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x63D0;&#x4F9B;&#x4E1A;&#x52A1;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x6D88;&#x9664;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#xFF0C;&#x63D0;&#x9AD8;IT&#x7684;&#x7814;&#x53D1;&#x548C;&#x8FD0;&#x8425;&#x6548;&#x7387;&#x3002;&#x4F5C;&#x4E3A;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x7684;&#x6838;&#x5FC3;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x6B63;&#x5728;&#x5448;&#x73B0;&#x51FA;&#x670D;&#x52A1;&#x5316;&#x3001;&#x81EA;&#x6CBB;&#x5316;&#x3001;&#x4E1A;&#x52A1;&#x5316;&#x3001;&#x4E00;&#x4F53;&#x5316;&#x7B49;&#x8BF8;&#x591A;&#x65B0;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF0C;&#x4E2D;&#x95F4;&#x4EF6;&#x5C06;&#x8FDB;&#x5165;2.0&#x65F6;&#x4EE3;&#xFF0C;&#x5C06;&#x6781;&#x5927;&#x63D0;&#x5347;&#x4E92;&#x8054;&#x7F51;&#x7EDF;&#x4E00;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x7684;&#x201C;&#x654F;&#x3001;&#x777F;&#x3001;&#x878D;&#x3001;&#x548C;&#x201D;&#x80FD;&#x529B;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="zhong-jian-jian-ding-yi.html" class="navigation navigation-prev " aria-label="Previous page: 中间件定义">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../corbaxiang-guan.html" class="navigation navigation-next " aria-label="Next page: Corba相关">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"中间件的发展趋势","level":"1.2.2","depth":2,"next":{"title":"Corba相关","level":"1.3","depth":1,"path":"corbaxiang-guan.md","ref":"corbaxiang-guan.md","articles":[{"title":"Corba兴衰史","level":"1.3.1","depth":2,"path":"corbaxiang-guan/corbaxing-shuai-shi.md","ref":"corbaxiang-guan/corbaxing-shuai-shi.md","articles":[]}]},"previous":{"title":"中间件定义","level":"1.2.1","depth":2,"path":"chapter1/zhong-jian-jian-ding-yi.md","ref":"chapter1/zhong-jian-jian-ding-yi.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/zhong-jian-jian-de-fa-zhan-qu-shi.md","mtime":"2019-03-05T08:40:03.744Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-05T08:42:15.825Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

